{
  "last_updated": "2025-12-22T10:47:15.716895",
  "months": [
    {
      "name": "December",
      "year": 2025
    },
    {
      "name": "January",
      "year": 2026
    }
  ],
  "releases": [
    {
      "title": "The Merchants Of Joy",
      "date": "2025-12-01",
      "platform": "Prime Video",
      "synopsis": "In the city that never sleeps, five families hustle each winter to turn sidewalks into holiday outposts. The Merchants of Joy follows these Christmas die-hards as they source, sell, and safeguard a family tradition at risk. It’s a warm, grounded portrait of pride, grit, and the joy they bring—one tree, one customer, one season at a time.",
      "type": "streaming",
      "letterboxd_rating": 3.48,
      "letterboxd_url": "https://letterboxd.com/film/the-merchants-of-joy/",
      "poster": "https://image.tmdb.org/t/p/w154/bMxiz9KwVminT5HCGOubkcHsK0c.jpg"
    },
    {
      "title": "Troll 2",
      "date": "2025-12-01",
      "platform": "Netflix",
      "synopsis": "When a dangerous new troll is awakened, unleashing devastation across Norway, beloved adventurers Nora, Andreas and Captain Kris are thrust into their most perilous mission yet.",
      "type": "streaming",
      "letterboxd_rating": 2.36,
      "letterboxd_url": "https://letterboxd.com/film/troll-2-2025/",
      "poster": "https://image.tmdb.org/t/p/w154/p6xAExLNFbHcLfvSuvLPoM8aqZU.jpg"
    },
    {
      "title": "Bau Artist At War",
      "date": "2025-12-02",
      "platform": "VOD/Digital",
      "synopsis": "Based on the true story of Joseph and Rebecca Bau whose wedding took place in the Plaszow concentration camp during WW2. Using his artistic skills in the camps, Joseph stays alive and helps hundreds to escape. Miraculously, he finds love in the midst of despair. Years later, when called to be a key witness in the trial of the brutal Nazi officer who tortured him and killed his father, Joseph is thrust back into vivid memories of the Holocaust. Now, he calls upon this love and resilience of spirit to face the ultimate demon of his past.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": "https://letterboxd.com/film/bau-artist-at-war/",
      "poster": "https://image.tmdb.org/t/p/w154/pMLKb0U2XctHx7xAeMxdko4kpCD.jpg"
    },
    {
      "title": "Griffin In Summer",
      "date": "2025-12-02",
      "platform": "Hulu",
      "synopsis": "Griffin (Everett Blunck) is the most ambitious playwright of his generation. He’s also fourteen years old. When his mom (Melanie Lynskey) hires a handsome 25-year-old handyman (Owen Teague), Griffin’s life and his new play take an inspired turn.",
      "type": "streaming",
      "letterboxd_rating": 3.56,
      "letterboxd_url": "https://letterboxd.com/film/griffin-in-summer/",
      "poster": "https://image.tmdb.org/t/p/w154/dyjJLpAaK4BvZQcZg3ryZrNqoHS.jpg"
    },
    {
      "title": "Sarahs Oil",
      "date": "2025-12-02",
      "platform": "Prime Video",
      "synopsis": "The true story of Sarah Rector, an African American born in Oklahoma Indian Territory in the early 1900s, who believes there is oil beneath the barren land she’s allotted and whose faith is proven right. As greedy oil sharks close in, Sarah turns to her family, friends and some Texas wildcatters to maintain control of her oil-rich land, eventually becoming one of the nation’s first female African American millionaires — at 11 years old.",
      "type": "streaming",
      "letterboxd_rating": 3.08,
      "letterboxd_url": "https://letterboxd.com/film/sarahs-oil/",
      "poster": "https://image.tmdb.org/t/p/w154/Av1CK61z33v2OBFLD1yF5rdRxQ1.jpg"
    },
    {
      "title": "Tapawingo",
      "date": "2025-12-02",
      "platform": "VOD/Digital",
      "synopsis": "Nate and Will are just two cool dudes who kill time between the local rec center and the Elk’s Lodge to take in a few hours of bingo. The beer is plentiful and the crowd is wild… well, old, but wild.When they’re not hanging loose, they’re training. Training for that one day they get the call to save nuns from rogue contras. Or maybe it’s to save orphans from the Red Army Tiger Force. Whatever it is, they’ll be ready. And until then, you can find them at their de facto HQ – the Tapawingo Regional Library.",
      "type": "streaming",
      "letterboxd_rating": 3.27,
      "letterboxd_url": "https://letterboxd.com/film/tapawingo/",
      "poster": "https://image.tmdb.org/t/p/w154/odg9u8ZkASNP8tMz4AM4BlSNtzG.jpg"
    },
    {
      "title": "Tron Ares",
      "date": "2025-12-02",
      "platform": "VOD/Digital",
      "synopsis": "A highly sophisticated Program called Ares is sent from the digital world into the real world on a dangerous mission, marking humankind’s first encounter with A.I. beings.",
      "type": "streaming",
      "letterboxd_rating": 2.69,
      "letterboxd_url": "https://letterboxd.com/film/tron-ares/",
      "poster": "https://image.tmdb.org/t/p/w154/chpWmskl3aKm1aTZqUHRCtviwPy.jpg"
    },
    {
      "title": "Truth Treason",
      "date": "2025-12-02",
      "platform": "VOD/Digital",
      "synopsis": "When loyalty to country becomes loyalty to a lie, one teen risks everything to expose the truth. With the Gestapo closing in, he must decide what it really means to be a good German.",
      "type": "streaming",
      "letterboxd_rating": 3.47,
      "letterboxd_url": "https://letterboxd.com/film/truth-treason/",
      "poster": "https://image.tmdb.org/t/p/w154/ArDLn658OjT3dMThIi4GDQJRuY3.jpg"
    },
    {
      "title": "My Secret Santa",
      "date": "2025-12-03",
      "platform": "Netflix",
      "synopsis": "A vivacious single mom in need of a job decides to disguise herself as a man in order to get hired as the seasonal Santa at a luxury ski resort. But when she starts to fall in love with the hotel manager, complications develop that could ruin everything.",
      "type": "streaming",
      "letterboxd_rating": 2.21,
      "letterboxd_url": "https://letterboxd.com/film/my-secret-santa/",
      "poster": "https://image.tmdb.org/t/p/w154/tpOAzBasKPsKwsUtPZOx1Mzuqq3.jpg"
    },
    {
      "title": "Oh What Fun",
      "date": "2025-12-03",
      "platform": "Prime Video",
      "synopsis": "Claire Clauster (Michelle Pfeiffer) is the glue that holds her chaotic, lovable family together every holiday season. From perfectly frosted cookies to meticulously wrapped gifts, no one decks the halls quite like Claire. But this year, as her grown kids and distracted husband get swept up in their own seasonal dramas, they make one crucial mistake: they forget their mom. By the time they realize she’s missing, Claire’s already set off on a festive adventure of her own – one that doesn’t involve cooking, cleaning, or coordinating anyone else’s chaos. As her family scrambles to find her and salvage their Christmas, Claire rediscovers what the holidays mean when you’re finally free to put yourself first.",
      "type": "streaming",
      "letterboxd_rating": 2.5,
      "letterboxd_url": "https://letterboxd.com/film/oh-what-fun/",
      "poster": "https://image.tmdb.org/t/p/w154/qynCyBKCJUUcj4wo4PE2aQVvote.jpg"
    },
    {
      "title": "Architecton",
      "date": "2025-12-04",
      "platform": "HBO Max",
      "synopsis": "An extraordinary journey through the material that makes up our habitat: concrete, and its ancestor, stone. Victor Kossakovsky raises a fundamental question: how do we inhabit the world of tomorrow?",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": "https://letterboxd.com/film/architecton/",
      "poster": "https://image.tmdb.org/t/p/w154/ko5fY3Y05u3rRFQUXNGyRybnxqT.jpg"
    },
    {
      "title": "Its Never Over Jeff Buckley",
      "date": "2025-12-04",
      "platform": "VOD/Digital",
      "synopsis": "Rising musician Jeff Buckley had only released one album when he died suddenly in 1997. Now, never-before-seen footage, exclusive voice messages, and accounts from those closest to him offer a portrait of the captivating singer.",
      "type": "streaming",
      "letterboxd_rating": 4.27,
      "letterboxd_url": "https://letterboxd.com/film/its-never-over-jeff-buckley/",
      "poster": "https://image.tmdb.org/t/p/w154/rrKe8bC6UKFKvfZHvbwA9Bq5hkR.jpg"
    },
    {
      "title": "Mission Impossible The Final Reckoning",
      "date": "2025-12-04",
      "platform": "Paramount+",
      "synopsis": "After escaping a calamitous train crash, Ethan realizes The Entity is stashed aboard an old Russian submarine, but a foe from his past named Gabriel is also on the trail.",
      "type": "streaming",
      "letterboxd_rating": 3.47,
      "letterboxd_url": "https://letterboxd.com/film/mission-impossible-the-final-reckoning/",
      "poster": "https://image.tmdb.org/t/p/w154/z53D72EAOxGRqdr7KXXWp9dJiDe.jpg"
    },
    {
      "title": "The Family Mcmullen",
      "date": "2025-12-05",
      "platform": "HBO Max",
      "synopsis": "30 years after the events of The Brothers McMullen, romantic entanglements plague a now fiftysomething Barry McMullen and his twentysomething kids, as well as his brother Patrick and widowed sister-in-law Molly, who are also facing similar unexpected hurdles.",
      "type": "streaming",
      "letterboxd_rating": 2.83,
      "letterboxd_url": "https://letterboxd.com/film/the-family-mcmullen/",
      "poster": "https://image.tmdb.org/t/p/w154/foNIl77csO9GmsvCvTZ6ixt0fZf.jpg"
    },
    {
      "title": "Jay Kelly",
      "date": "2025-12-05",
      "platform": "Netflix",
      "synopsis": "Famous movie actor Jay Kelly and his devoted manager Ron embark on a whirlwind and unexpectedly profound journey through Europe. Along the way, both men are forced to confront the choices they’ve made, the relationships with their loved ones, and the legacies they’ll leave behind.",
      "type": "streaming",
      "letterboxd_rating": 3.37,
      "letterboxd_url": "https://letterboxd.com/film/jay-kelly/",
      "poster": "https://image.tmdb.org/t/p/w154/bKLm1xS9DsODWB4i1SxTEvLXab9.jpg"
    },
    {
      "title": "Man Finds Tape",
      "date": "2025-12-05",
      "platform": "VOD/Digital",
      "synopsis": "Pulled in by a series of strange and unexplainable video clips, a brother and sister team up to investigate the events captured in the footage, only to discover a shocking secret that’s overtaking their small-town Texas community.",
      "type": "streaming",
      "letterboxd_rating": 2.87,
      "letterboxd_url": "https://letterboxd.com/film/man-finds-tape/",
      "poster": "https://image.tmdb.org/t/p/w154/1WMaJEwwsw8ALCo1mRGjjTV5e8T.jpg"
    },
    {
      "title": "The New Yorker At 100",
      "date": "2025-12-05",
      "platform": "Netflix",
      "synopsis": "It is considered one of the most culturally significant magazines of all time. Now, as The New Yorker marks its centennial, the iconic publication is granting unprecedented access to its inner workings, its contributors, and its archives. This documentary follows the editors, writers and creatives behind the scenes of one of the last print magazines of our time.",
      "type": "streaming",
      "letterboxd_rating": 3.54,
      "letterboxd_url": "https://letterboxd.com/film/the-new-yorker-at-100/",
      "poster": "https://image.tmdb.org/t/p/w154/4vNUHGzIFxI267gFZpq3eM8m0bl.jpg"
    },
    {
      "title": "Pose",
      "date": "2025-12-05",
      "platform": "VOD/Digital",
      "synopsis": "Isolated in a grand country manor, a reclusive artist named Thomas Alexander (James McAvoy) spends a passionate and paranoid weekend with his ex-lover, an obsessive fan, and a potential muse. Thomas engages in a psychological game with his housemates, hoping to spark a new wave of artistic brilliance. Over the course of a few tumultuous days filled with chaos and revelation, not all of them will make it out alive.",
      "type": "streaming",
      "letterboxd_rating": 2.45,
      "letterboxd_url": "https://letterboxd.com/film/pose-2025/",
      "poster": "https://image.tmdb.org/t/p/w154/qhyyyWrHUbl6QG4udAJj17CBa5.jpg"
    },
    {
      "title": "Reflection In A Dead Diamond",
      "date": "2025-12-05",
      "platform": "Shudder",
      "synopsis": "When the mysterious woman in the room next door disappears, a debonair 70-year-old ex-spy living in a luxury hotel on the Côte d’Azur is confronted by the demons and darlings of a lurid past in which moviemaking, memories and madness collide.",
      "type": "streaming",
      "letterboxd_rating": 3.57,
      "letterboxd_url": "https://letterboxd.com/film/reflection-in-a-dead-diamond/",
      "poster": "https://image.tmdb.org/t/p/w154/5CdRxBu7jRDHjthkAL8vE0GdKUD.jpg"
    },
    {
      "title": "Predators",
      "date": "2025-12-08",
      "platform": "Paramount+",
      "synopsis": "“To Catch a Predator” was a popular television show designed to hunt down child predators and lure them to a film set, where they would be interviewed and eventually arrested. An exploration of the scintillating rise and staggering fall of the show and the world it helped create.",
      "type": "streaming",
      "letterboxd_rating": 3.64,
      "letterboxd_url": "https://letterboxd.com/film/predators-2025/",
      "poster": "https://image.tmdb.org/t/p/w154/epjqcM33F3PKRZmj3KbpsXlJ3gY.jpg"
    },
    {
      "title": "The Carpenters Son",
      "date": "2025-12-09",
      "platform": "VOD/Digital",
      "synopsis": "A remote village in Roman-era Egypt explodes into spiritual warfare when a carpenter, his wife and their child are targeted by supernatural forces.",
      "type": "streaming",
      "letterboxd_rating": 2.63,
      "letterboxd_url": "https://letterboxd.com/film/the-carpenters-son/",
      "poster": "https://image.tmdb.org/t/p/w154/tXEtdZjoaHqjDjSxZJWwDVjIfx9.jpg"
    },
    {
      "title": "Chainsaw Man The Movie Reze Arc",
      "date": "2025-12-09",
      "platform": "VOD/Digital",
      "synopsis": "In a brutal war between devils, hunters, and secret enemies, a mysterious girl named Reze has stepped into Denji’s world, and he faces his deadliest battle yet, fueled by love in a world where survival knows no rules.",
      "type": "streaming",
      "letterboxd_rating": 4.36,
      "letterboxd_url": "https://letterboxd.com/film/chainsaw-man-the-movie-reze-arc/",
      "poster": "https://image.tmdb.org/t/p/w154/pHyxb2RV5wLlboAwm9ZJ9qTVEDw.jpg"
    },
    {
      "title": "Christy",
      "date": "2025-12-09",
      "platform": "VOD/Digital",
      "synopsis": "Christy Martin never imagined life beyond her small-town roots in West Virginia—until she discovered a knack for punching people. Fueled by grit, raw determination, and an unshakable desire to win, she charges into the world of boxing under the guidance of her trainer and manager-turned-husband, Jim. But while Christy flaunts a fiery persona in the ring, her toughest battles unfold outside it—confronting family, identity, and a relationship that just might become life-or-death.",
      "type": "streaming",
      "letterboxd_rating": 3.69,
      "letterboxd_url": "https://letterboxd.com/film/christy-2025/",
      "poster": "https://image.tmdb.org/t/p/w154/ssy1uHGZkuXLkIWJWrtsBczPvVC.jpg"
    },
    {
      "title": "Keeper",
      "date": "2025-12-09",
      "platform": "VOD/Digital",
      "synopsis": "Liz and Malcolm escape for a romantic anniversary weekend at a secluded cabin. When Malcolm suddenly returns to the city, Liz finds herself isolated and in the presence of an unspeakable evil that reveals the cabin’s horrifying secrets.",
      "type": "streaming",
      "letterboxd_rating": 2.57,
      "letterboxd_url": "https://letterboxd.com/film/keeper-2025/",
      "poster": "https://image.tmdb.org/t/p/w154/mbGHijUc0C3fcM12l6ro6FgxIvg.jpg"
    },
    {
      "title": "Koln 75",
      "date": "2025-12-09",
      "platform": "VOD/Digital",
      "synopsis": "Keith Jarrett’s legendary performance in January 1975 nearly didn’t happen. Based on a true story, Köln 75 follows how the concert was conceived and orchestrated by the efforts of a teenage up and coming concert promoter, Vera Brandes, (played by German actress Mala Emde). Her enthusiasm set her to multitasking – from organizing the concert venue (the Cologne Opera House), promoting the event, and selling the tickets, to convincing Jarrett to perform when he almost dropped out when the Bösendorfer Imperial Grand piano he was promised was nowhere to be found. John Magaro plays Jarrett with his own intensity, a sublime counterpoint to Mala Emde’s joyful portrayal of the enthusiastic and unstoppable Vera. Köln 75 captures the compelling, entertaining and, until now, unknown backstory about Jarrett’s one-hour, entirely improvised concert, which became the best-selling solo album in jazz history.",
      "type": "streaming",
      "letterboxd_rating": 3.52,
      "letterboxd_url": "https://letterboxd.com/film/koln-75/",
      "poster": "https://image.tmdb.org/t/p/w154/oMeg1capgysYPHVOnZq7HfoIXzE.jpg"
    },
    {
      "title": "A Savage Art The Life Cartoons Of Pat Oliphant",
      "date": "2025-12-09",
      "platform": "VOD/Digital",
      "synopsis": "Patrick Oliphant was a giant slayer, bravely taking on presidents, popes and the American corporate class with his mighty pen. An Australian transplant, Oliphant became America’s most renowned and feared political cartoonist for five decades. With his biting wit and masterful drawing skills, Oliphant attacked individual and institutional corruption, collusion, greed, hypocrisy and arrogance, no matter the size or status of his targets.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": "https://letterboxd.com/film/a-savage-art-the-life-cartoons-of-pat-oliphant/",
      "poster": "https://image.tmdb.org/t/p/w154/9JvDJioZk0vkZX6QSPw2Ayq8wzv.jpg"
    },
    {
      "title": "Merv",
      "date": "2025-12-10",
      "platform": "Prime Video",
      "synopsis": "When their beloved dog Merv loses his spark after their split, Anna (Zooey Deschanel) and Russ (Charlie Cox) are forced into the world’s most awkward co-parenting arrangement. Hoping to shake Merv out of his funk, Russ takes him to Florida for a much-needed getaway—only for Anna to show up unexpectedly. As Merv slowly gets his groove back, turns out fixing their dog’s broken heart may lead to a few sparks of their own.",
      "type": "streaming",
      "letterboxd_rating": 2.59,
      "letterboxd_url": "https://letterboxd.com/film/merv-2025/",
      "poster": "https://image.tmdb.org/t/p/w154/nfGlYjINEcGtxV46viW4olwHHSz.jpg"
    },
    {
      "title": "F1 The Movie",
      "date": "2025-12-12",
      "platform": "Apple TV",
      "synopsis": "Racing legend Sonny Hayes is coaxed out of retirement to lead a struggling Formula 1 team—and mentor a young hotshot driver—while chasing one more chance at glory.",
      "type": "streaming",
      "letterboxd_rating": 3.72,
      "letterboxd_url": "https://letterboxd.com/film/f1-the-movie/",
      "poster": "https://image.tmdb.org/t/p/w154/9PXZIUsSDh4alB80jheWX4fhZmy.jpg"
    },
    {
      "title": "Influencers",
      "date": "2025-12-12",
      "platform": "Shudder",
      "synopsis": "In Southern France, a young woman’s chilling fascination with murder and identity theft sends her life into a whirlwind of chaos.",
      "type": "streaming",
      "letterboxd_rating": 3.19,
      "letterboxd_url": "https://letterboxd.com/film/influencers-2025/",
      "poster": "https://image.tmdb.org/t/p/w154/nRdjGDxBW60OhzjAtikLgQBwt3B.jpg"
    },
    {
      "title": "The Mastermind",
      "date": "2025-12-12",
      "platform": "MUBI",
      "synopsis": "In a sedate corner of Massachusetts circa 1970, an unemployed carpenter turned amateur art thief plans his first big heist. When things go haywire, his life unravels.",
      "type": "streaming",
      "letterboxd_rating": 3.26,
      "letterboxd_url": "https://letterboxd.com/film/the-mastermind-2025/",
      "poster": "https://image.tmdb.org/t/p/w154/oPaEQ3m4zHOzIAstgXCZZtzcHTL.jpg"
    },
    {
      "title": "Modi",
      "date": "2025-12-12",
      "platform": "VOD/Digital",
      "synopsis": "A 72-hour whirlwind in the life of bohemian artist Amedeo Modigliani, known as Modi to his friends, follows a chaotic series of events through the streets of war torn Paris in 1916. On the run from the police, his desire to end his career and leave the city is dismissed by fellow artists Maurice Utrillo, Chaim Soutine and Modi’s muse, Beatrice Hastings. Modi seeks advice from his art dealer and friend, Leopold Zborowski — however, after a night of hallucinations, the chaos in Modi’s mind reaches a crescendo when faced with an American collector, Maurice Gangnat, who has the power to change his life.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": "https://letterboxd.com/film/modi/",
      "poster": "https://image.tmdb.org/t/p/w154/kJwPFeJRigreFdSTVWkdkVRAGwq.jpg"
    },
    {
      "title": "Spinal Tap Ii The End Continues",
      "date": "2025-12-12",
      "platform": "HBO Max",
      "synopsis": "Spinal Tap, England’s loudest and most punctual band, reunite following a 15-year hiatus for one final concert.",
      "type": "streaming",
      "letterboxd_rating": 3.11,
      "letterboxd_url": "https://letterboxd.com/film/spinal-tap-ii-the-end-continues/",
      "poster": "https://image.tmdb.org/t/p/w154/h6DGrDHlDm6gVOiy3YeOb737jB4.jpg"
    },
    {
      "title": "Wake Up Dead Man A Knives Out Mystery",
      "date": "2025-12-12",
      "platform": "Netflix",
      "synopsis": "When young priest Jud Duplenticy is sent to assist charismatic firebrand Monsignor Jefferson Wicks, it’s clear that all is not well in the pews. After a sudden and seemingly impossible murder rocks the town, the lack of an obvious suspect prompts local police chief Geraldine Scott to join forces with renowned detective Benoit Blanc to unravel a mystery that defies all logic.",
      "type": "streaming",
      "letterboxd_rating": 3.86,
      "letterboxd_url": "https://letterboxd.com/film/wake-up-dead-man-a-knives-out-mystery/",
      "poster": "https://image.tmdb.org/t/p/w154/qCOGGi8JBVEZMc3DVby8rUivyXz.jpg"
    },
    {
      "title": "The Prosecutor",
      "date": "2025-12-13",
      "platform": "Prime Video",
      "synopsis": "A poor young man is wrongly charged with drug trafficking after being deceived. An ex-prosecutor investigates the case, uncovers a corrupt lawyer team’s scheme, and restores justice despite obstruction from evil forces.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": "https://letterboxd.com/film/the-prosecutor/",
      "poster": "https://image.tmdb.org/t/p/w154/n3ZnFqp988MWfIkT8OHofEJfjlt.jpg"
    },
    {
      "title": "Eye For An Eye",
      "date": "2025-12-15",
      "platform": "Starz",
      "synopsis": "Anna, grieving the sudden death of her parents, relocates from New York to a small Florida town to live with the grandmother she has never met. Isolated, vulnerable, and in need of friends, she finds brief solace in the company of two local teens. But when she becomes complicit to their unforgivable act of violence, she finds herself ensnared by Mr. Sandman – the twisted soul of a tormented child who haunts bullies’ dreams before feasting on their eyeballs when they finally wake – Anna must right her wrong before becoming a victim of this gruesome curse.",
      "type": "streaming",
      "letterboxd_rating": 2.69,
      "letterboxd_url": "https://letterboxd.com/film/eye-for-an-eye-2025/",
      "poster": "https://image.tmdb.org/t/p/w154/mkfznkTshGBp88SFQQAGsr3R62z.jpg"
    },
    {
      "title": "It Was Just An Accident",
      "date": "2025-12-16",
      "platform": "VOD/Digital",
      "synopsis": "Night driver Eghbal, en route with his pregnant wife, kills a dog. Stranded, he seeks help at Vahid’s garage, unaware his rescuer believes him to be the prison officer who tortured him. Convinced, Vahid abducts Eghbal to bury him alive, but doubts soon arise. To confirm Eghbal’s identity, Vahid enlists fellow victims. During their ride, they contemplate the morality of killing their captive and whether he actually is who they believe him to be.",
      "type": "streaming",
      "letterboxd_rating": 3.99,
      "letterboxd_url": "https://letterboxd.com/film/it-was-just-an-accident/",
      "poster": "https://image.tmdb.org/t/p/w154/eNYGj2DG3n8OrVPTfYunpPW9uas.jpg"
    },
    {
      "title": "King Ivory",
      "date": "2025-12-16",
      "platform": "VOD/Digital",
      "synopsis": "Based on extensive research involving law enforcement and gang members, a never-before-seen, authentic look inside the underworld of fentanyl trafficking from gangs inside the Oklahoma State Penitentiary at McAlester a.k.a. “Big Mac.”",
      "type": "streaming",
      "letterboxd_rating": 3.14,
      "letterboxd_url": "https://letterboxd.com/film/king-ivory/",
      "poster": "https://image.tmdb.org/t/p/w154/qtNdrKvD5MqvUbAQEja5WaKuVN1.jpg"
    },
    {
      "title": "Megadoc",
      "date": "2025-12-16",
      "platform": "VOD/Digital",
      "synopsis": "A raw, fly-on-the-wall documentary about Francis Ford Coppola’s decades-long journey in creating his self-financed passion project, MEGALOPOLIS. The bold and unrelenting epic returns in Mike Figgis’ portrait of Coppola’s creative process – weaving together archival material, unfiltered cast interviews, and a close-up view of how the legendary filmmaker drew from Roman history, political allegory, and his own singular vision to shape the world of Megalopolis. This isn’t a record of a production on the brink, it’s a personal memoir unfolding in real time.",
      "type": "streaming",
      "letterboxd_rating": 3.51,
      "letterboxd_url": "https://letterboxd.com/film/megadoc/",
      "poster": "https://image.tmdb.org/t/p/w154/yjiqwnvgst3ntm25L5heBHjqny9.jpg"
    },
    {
      "title": "Now You See Me Now You Dont",
      "date": "2025-12-16",
      "platform": "VOD/Digital",
      "synopsis": "The Four Horsemen return along with a new generation of illusionists performing mind-melding twists, turns, surprises, and magic unlike anything ever captured on film.",
      "type": "streaming",
      "letterboxd_rating": 3.01,
      "letterboxd_url": "https://letterboxd.com/film/now-you-see-me-now-you-dont-2025/",
      "poster": "https://image.tmdb.org/t/p/w154/oD3Eey4e4Z259XLm3eD3WGcoJAh.jpg"
    },
    {
      "title": "Put Your Soul On Your Hand And Walk",
      "date": "2025-12-16",
      "platform": "VOD/Digital",
      "synopsis": "Put Your Soul on Your Hand and Walk offers an intimate, first-hand perspective on life under siege in Gaza, captured through video calls between director Sepideh Farsi and 25-year-old Palestinian photojournalist and poet Fatma Hassona. Combining raw immediacy with deep humanity, the film captures daily life during the conflict through the eyes and unwaveringly optimistic presence of Fatma, a talented photographer whose generation is trapped in an endless cycle of war, famine, and resistance. Her conversations with Farsi bring us into the heart of the conflict, even while their physical distance underscores the dire situation inside Gaza. Put Your Soul on Your Hand and Walk is an essential document that now stands as a heartfelt memorial and final testament: Fatma and her family were tragically killed by a targeted Israeli airstrike on April 16, one day after the film was announced as a selection of the Cannes Film Festival.",
      "type": "streaming",
      "letterboxd_rating": 4.06,
      "letterboxd_url": "https://letterboxd.com/film/put-your-soul-on-your-hand-and-walk/",
      "poster": "https://image.tmdb.org/t/p/w154/vrEDz3kBG6AZKF3aiaQJB0Qgp8a.jpg"
    },
    {
      "title": "The Running Man",
      "date": "2025-12-16",
      "platform": "VOD/Digital",
      "synopsis": "Set in an oppressive future where the government controls the media, Ben Richards volunteers to participate in a deadly game show, which will see him hunted by professional killers over 30 days. Should he survive, he’ll win a cash prize that will help save his sick child and lift his family out of a horrid living situation.",
      "type": "streaming",
      "letterboxd_rating": 3.18,
      "letterboxd_url": "https://letterboxd.com/film/the-running-man-2025/",
      "poster": "https://image.tmdb.org/t/p/w154/dKL78O9zxczVgjtNcQ9UkbYLzqX.jpg"
    },
    {
      "title": "Sisu Road To Revenge",
      "date": "2025-12-16",
      "platform": "VOD/Digital",
      "synopsis": "Returning to the house where his family was brutally murdered during the war, ‘the man who refuses to die’ dismantles it, loads it on a truck, and is determined to rebuild it somewhere safe in their honor. When the Red Army commander who killed his family comes back hellbent on finishing the job, a relentless, eye-popping cross-country chase ensues – a fight to the death.",
      "type": "streaming",
      "letterboxd_rating": 3.31,
      "letterboxd_url": "https://letterboxd.com/film/sisu-road-to-revenge/",
      "poster": "https://image.tmdb.org/t/p/w154/jNsttCWZyPtW66MjhUozBzVsRb7.jpg"
    },
    {
      "title": "Thieves Highway",
      "date": "2025-12-16",
      "platform": "VOD/Digital",
      "synopsis": "After a deadly confrontation, lawman Frank Bennett (Aaron Eckhart) uncovers a massive smuggling operation. Cut off from cell service and stranded without his truck, Frank is forced to take on a dangerous gang led by a deranged ex-military commander. Stopping them before they reach the border isn’t just his duty, it’s his only shot at survival.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": "https://letterboxd.com/film/thieves-highway-2025/",
      "poster": "https://image.tmdb.org/t/p/w154/78B66xBCgmnh88d10B85uFjC88V.jpg"
    },
    {
      "title": "The Thing With Feathers",
      "date": "2025-12-16",
      "platform": "VOD/Digital",
      "synopsis": "Following the death of his wife, a young father’s hold on reality crumbles and a strange presence begins to stalk him from the shadowy recesses of the apartment he shares with his two young sons.",
      "type": "streaming",
      "letterboxd_rating": 3.33,
      "letterboxd_url": "https://letterboxd.com/film/the-thing-with-feathers-2025/",
      "poster": "https://image.tmdb.org/t/p/w154/j3kM0tMW7EQaOrit0JW9NvoPPrp.jpg"
    },
    {
      "title": "Breakdown 1975",
      "date": "2025-12-19",
      "platform": "Netflix",
      "synopsis": "In 1975, as America faced social and political upheaval, filmmakers turned chaos into art. This documentary explores how a turbulent era gave rise to iconic movies like “Taxi Driver,” “One Flew Over the Cuckoo’s Nest” and “Network.” “Breakdown: 1975” is directed by Academy Award-winner Morgan Neville.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": "https://letterboxd.com/film/breakdown-1975/",
      "poster": "https://image.tmdb.org/t/p/w154/6LirpQnBmBpAOa5Me1lBCBBy90e.jpg"
    },
    {
      "title": "The Great Flood",
      "date": "2025-12-19",
      "platform": "Netflix",
      "synopsis": "A disastrous great flood sweeps the planet. On what may be the last day on Earth, a desperate fight ensues to save a child from a flooding apartment.",
      "type": "streaming",
      "letterboxd_rating": 2.66,
      "letterboxd_url": "https://letterboxd.com/film/the-great-flood-2025/",
      "poster": "https://image.tmdb.org/t/p/w154/1tUOZQDgZaGqZtrB21MieiXARL2.jpg"
    },
    {
      "title": "Him",
      "date": "2025-12-19",
      "platform": "Peacock",
      "synopsis": "After suffering a potentially career-ending brain trauma, Cameron Cade receives a lifeline when his hero, legendary eight-time Championship quarterback and cultural megastar Isaiah White, offers to train Cam at Isaiah’s isolated compound that he shares with his celebrity influencer wife. But as Cam’s training accelerates, Isaiah’s charisma begins to curdle into something darker.",
      "type": "streaming",
      "letterboxd_rating": 2.55,
      "letterboxd_url": "https://letterboxd.com/film/him-2025/",
      "poster": "https://image.tmdb.org/t/p/w154/qPJzcYR2f1O1uynYBCVPPJuOiAH.jpg"
    },
    {
      "title": "One Battle After Another",
      "date": "2025-12-19",
      "platform": "HBO Max",
      "synopsis": "Washed-up revolutionary Bob exists in a state of stoned paranoia, surviving off-grid with his spirited, self-reliant daughter, Willa. When his evil nemesis resurfaces after 16 years and she goes missing, the former radical scrambles to find her, father and daughter both battling the consequences of his past.",
      "type": "streaming",
      "letterboxd_rating": 4.29,
      "letterboxd_url": "https://letterboxd.com/film/one-battle-after-another/",
      "poster": "https://image.tmdb.org/t/p/w154/r4uXvqCeco0KmO0CjlhXuTEFuSE.jpg"
    },
    {
      "title": "Queens Of The Dead",
      "date": "2025-12-19",
      "platform": "Shudder",
      "synopsis": "When a zombie apocalypse breaks out in Brooklyn on the night of a giant warehouse party, an eclectic group of drag queens, club kids, & frenemies must put aside their drama and use their unique skills to fight against the brain-thirsty, scrolling undead.",
      "type": "streaming",
      "letterboxd_rating": 3.25,
      "letterboxd_url": "https://letterboxd.com/film/queens-of-the-dead/",
      "poster": "https://image.tmdb.org/t/p/w154/mY8JqSMBSiXZh9EbGqUjpF6aacu.jpg"
    },
    {
      "title": "Relay",
      "date": "2025-12-19",
      "platform": "Netflix",
      "synopsis": "Tom, a world class “fixer”, specializes in brokering lucrative payoffs between corrupt corporations and the individuals who threaten their ruin. He keeps his identity a secret through meticulous planning and always follows an exacting set of rules. But when a message arrives one day from potential client Sarah, needing Tom’s protection just to stay alive, the rules quickly start to change.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": "https://letterboxd.com/film/relay-2025/",
      "poster": "https://image.tmdb.org/t/p/w154/mpwccO2L8LUVtVTJTdgUVgoQqAo.jpg"
    },
    {
      "title": "Ne Zha Ii",
      "date": "2025-12-20",
      "platform": "HBO Max",
      "synopsis": "A rebellious young boy, Ne Zha, is feared by the gods and born to mortal parents with wild, uncontrolled powers. Now he’s faced with an ancient force intent on destroying humanity, he must grow up to become the hero the world needs.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": "https://image.tmdb.org/t/p/w154/cb5NyNrqiCNNoDkA8FfxHAtypdG.jpg"
    },
    {
      "title": "Afterburn",
      "date": "2025-12-22",
      "platform": "MGM+",
      "synopsis": "After a massive solar flare destroys the Earth’s eastern hemisphere, an emboldened treasure hunter for hire adventures to Europe to uncover the coveted Mona Lisa, only to learn the world needs a hero more than it needs a painting.",
      "type": "streaming",
      "letterboxd_rating": 2.06,
      "letterboxd_url": "https://letterboxd.com/film/afterburn-2025/",
      "poster": "https://image.tmdb.org/t/p/w154/hrze9JXp2QJpc2WjLfSUtRxyYSb.jpg"
    },
    {
      "title": "Aztec Batman Clash Of Empires",
      "date": "2025-12-22",
      "platform": "HBO Max",
      "synopsis": "In the time of the Aztec Empire, Yohualli Coatl – a young Aztec boy – experiences tragedy when his father and village leader, Toltecatzin, is murdered by Spanish Conquistadors. Yohualli escapes to Tenochtitlan to warn King Moctezuma and his high priest, Yoka, of imminent danger. Using the temple of Tzinacan, the bat god, as a lair, Yohualli trains with his mentor and assistant, Acatzin, developing equipment and weaponry to confront the Spaniard invasion, protect Moctezuma’s temple, and avenge his father’s death.",
      "type": "streaming",
      "letterboxd_rating": 3.01,
      "letterboxd_url": "https://letterboxd.com/film/aztec-batman-clash-of-empires/",
      "poster": "https://image.tmdb.org/t/p/w154/s0Mlo5w4INp3bUdsJo3RaSSMXWz.jpg"
    },
    {
      "title": "Die My Love",
      "date": "2025-12-23",
      "platform": "MUBI",
      "synopsis": "Grace, a writer and young mother, is slowly slipping into madness. Locked away in an old house in and around Montana, we see her acting increasingly agitated and erratic, leaving her companion, Jackson, increasingly worried and helpless.",
      "type": "streaming",
      "letterboxd_rating": 3.22,
      "letterboxd_url": "https://letterboxd.com/film/die-my-love/",
      "poster": "https://image.tmdb.org/t/p/w154/kajpShbFhOdpl6yCrLezMrr9tB4.jpg"
    },
    {
      "title": "100 Nights Of Hero",
      "date": "2025-12-23",
      "platform": "VOD/Digital",
      "synopsis": "When a charming house guest arrives at a remote castle, the delicate dynamic between a neglectful husband, his innocent bride Cherry and their devoted maid Hero is thrown into chaos.",
      "type": "streaming",
      "letterboxd_rating": 3.29,
      "letterboxd_url": "https://letterboxd.com/film/100-nights-of-hero/",
      "poster": "https://image.tmdb.org/t/p/w154/7OYSJJFU2E9iBGPfU9C9PM56APM.jpg"
    },
    {
      "title": "Eden",
      "date": "2025-12-23",
      "platform": "Netflix",
      "synopsis": "A group of people is fueled by a profound desire for change. In order to turn their back to society they leave everything behind and set their futures on the harsh landscape of the Galapagos.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": "https://letterboxd.com/film/eden-2025/",
      "poster": "https://image.tmdb.org/t/p/w154/jbFEESMVbpJU8IjZBjiWGJdEsxR.jpg"
    },
    {
      "title": "Eternity",
      "date": "2025-12-23",
      "platform": "VOD/Digital",
      "synopsis": "In an afterlife where souls have one week to decide where to spend eternity, Joan is faced with the impossible choice between the man she spent her life with and her first love, who died young and has waited decades for her to arrive.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": "https://letterboxd.com/film/eternity-2025/",
      "poster": "https://image.tmdb.org/t/p/w154/iKaM4OfSf5ABkFZCo4vU4Dth7ZU.jpg"
    },
    {
      "title": "Five Nights At Freddys 2",
      "date": "2025-12-23",
      "platform": "VOD/Digital",
      "synopsis": "One year since the supernatural nightmare at Freddy Fazbear’s Pizza, the stories about what transpired there have been twisted into a campy local legend, inspiring the town’s first ever Fazfest. With the truth about what transpired kept from her, Abby sneaks out to reconnect with Freddy, Bonnie, Chica, and Foxy, setting into motion a terrifying series of events that will reveal dark secrets about the true origin of Freddy’s, and unleash a long-forgotten horror hidden away for decades.",
      "type": "streaming",
      "letterboxd_rating": 2.7,
      "letterboxd_url": "https://letterboxd.com/film/five-nights-at-freddys-2/",
      "poster": "https://image.tmdb.org/t/p/w154/udAxQEORq2I5wxI97N2TEqdhzBE.jpg"
    },
    {
      "title": "Nuremberg",
      "date": "2025-12-23",
      "platform": "VOD/Digital",
      "synopsis": "The Allies, led by the unyielding chief prosecutor, Robert H. Jackson (Michael Shannon), have the task of ensuring the Nazi regime answers for the unveiled horrors of the Holocaust while a US Army psychiatrist (Rami Malek) is locked in a dramatic psychological duel with former Reichsmarschall Herman Göring (Russell Crowe).",
      "type": "streaming",
      "letterboxd_rating": 3.49,
      "letterboxd_url": "https://letterboxd.com/film/nuremberg-2025/",
      "poster": "https://image.tmdb.org/t/p/w154/fi7GXCxe0hIQRWwvIkZ1wI3fCHk.jpg"
    },
    {
      "title": "Sentimental Value",
      "date": "2025-12-23",
      "platform": "VOD/Digital",
      "synopsis": "Sisters Nora and Agnes reunite with their estranged father, the charismatic Gustav, a once-renowned director who offers stage actress Nora a role in what he hopes will be his comeback film. When Nora turns it down, she soon discovers he has given her part to an eager young Hollywood star. Suddenly, the two sisters must navigate their complicated relationship with their father — and deal with an American star dropped right into the middle of their complex family dynamics.",
      "type": "streaming",
      "letterboxd_rating": 4.22,
      "letterboxd_url": "https://letterboxd.com/film/sentimental-value-2025/",
      "poster": "https://image.tmdb.org/t/p/w154/9Lk6KZm9Fg7N3gyOX8SMF7WByQk.jpg"
    },
    {
      "title": "Springsteen Deliver Me From Nowhere",
      "date": "2025-12-23",
      "platform": "VOD/Digital",
      "synopsis": "Visionary musician Bruce Springsteen embarks on an emotional journey to record “Nebraska.”",
      "type": "streaming",
      "letterboxd_rating": 3.24,
      "letterboxd_url": "https://letterboxd.com/film/springsteen-deliver-me-from-nowhere/",
      "poster": "https://image.tmdb.org/t/p/w154/csBV3eq4RDjNg1acNQ8kwOZyPlZ.jpg"
    },
    {
      "title": "Strange Harvest",
      "date": "2025-12-23",
      "platform": "Hulu",
      "synopsis": "Detectives are thrust into a chilling hunt for “Mr. Shiny”—a sadistic serial killer from the past whose return marks the beginning of a new wave of grotesque, otherworldly crimes tied to a dark cosmic force.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": "https://letterboxd.com/film/strange-harvest/",
      "poster": "https://image.tmdb.org/t/p/w154/fYe0FNJNy0EIb8q4JUMLbbSmCth.jpg"
    },
    {
      "title": "Goodbye June",
      "date": "2025-12-24",
      "platform": "Netflix",
      "synopsis": "Four siblings’ lives change drastically when their ailing mother takes a turn for the worse over the holiday season.",
      "type": "streaming",
      "letterboxd_rating": 3.34,
      "letterboxd_url": "https://letterboxd.com/film/goodbye-june/",
      "poster": "https://image.tmdb.org/t/p/w154/xJ4SNjqfS8DyCOoxK0KD3e1b2JB.jpg"
    },
    {
      "title": "Bugonia",
      "date": "2025-12-26",
      "platform": "Peacock",
      "synopsis": "Two conspiracy obsessed young men kidnap the high-powered CEO of a major company, convinced that she is an alien intent on destroying planet Earth.",
      "type": "streaming",
      "letterboxd_rating": 3.92,
      "letterboxd_url": "https://letterboxd.com/film/bugonia/",
      "poster": "https://image.tmdb.org/t/p/w154/oxgsAQDAAxA92mFGYCZllgWkH9J.jpg"
    },
    {
      "title": "Cover Up",
      "date": "2025-12-26",
      "platform": "Netflix",
      "synopsis": "For the past six decades, Seymour Hersh has been at the front lines of political journalism in the U.S. This arresting documentary, released at a crucial moment for the freedom of the press, tells the wide-ranging story of this breakthrough reporter.",
      "type": "streaming",
      "letterboxd_rating": 3.82,
      "letterboxd_url": "https://letterboxd.com/film/cover-up-2025/",
      "poster": "https://image.tmdb.org/t/p/w154/i5WTgxEFiZTe7BnR8rig90ALU6Y.jpg"
    },
    {
      "title": "The Jester 2",
      "date": "2025-12-26",
      "platform": "Shudder",
      "synopsis": "On Halloween night, the Jester, a malevolent supernatural trickster, crosses paths with Max, a 15-year-old girl, forcing her into an uneasy alliance for the evening. Max must use all her wits to try and outsmart a dangerous magician who is truly magic.",
      "type": "streaming",
      "letterboxd_rating": 2.5,
      "letterboxd_url": "https://letterboxd.com/film/the-jester-2/",
      "poster": "https://image.tmdb.org/t/p/w154/47dsw1jSOV0Be5zmy7CtLhYpqU.jpg"
    },
    {
      "title": "Fackham Hall",
      "date": "2025-12-26",
      "platform": "VOD/Digital",
      "synopsis": "A new porter who embarks on an unlikely relationship with the youngest daughter of a prominent UK family. At the same time, rivalries are spilling over in the Davenport family, led by Lord and Lady Davenport as they also weather the epic failure of the wedding of their eldest daughter to her caddish cousin.",
      "type": "streaming",
      "letterboxd_rating": 3.06,
      "letterboxd_url": "https://letterboxd.com/film/fackham-hall/",
      "poster": "https://image.tmdb.org/t/p/w154/fwpdRe6WGmzqXFEJYJVepDQ6jrw.jpg"
    },
    {
      "title": "The Life Of Chuck",
      "date": "2025-12-26",
      "platform": "Hulu",
      "synopsis": "In this extraordinary story of an ordinary man, Charles ‘Chuck’ Krantz experiences the wonder of love, the heartbreak of loss, and the multitudes contained in all of us.",
      "type": "streaming",
      "letterboxd_rating": 3.69,
      "letterboxd_url": "https://letterboxd.com/film/the-life-of-chuck/",
      "poster": "https://image.tmdb.org/t/p/w154/oumprkO9bThExP8NwxBIBnvBu2v.jpg"
    },
    {
      "title": "The Threesome",
      "date": "2025-12-27",
      "platform": "Netflix",
      "synopsis": "Connor is a kind and unassuming young man, who, along with his long-time crush Olivia, engages in a threesome with a sweet, alluring stranger named Jenny. This encounter sparks a relationship between Connor and Olivia, leading them to plan a life together. However, their romance faces challenges when Jenny reappears, thrusting all three into a difficult journey toward true accountability and adulthood.",
      "type": "streaming",
      "letterboxd_rating": 3.19,
      "letterboxd_url": "https://letterboxd.com/film/the-threesome/",
      "poster": "https://image.tmdb.org/t/p/w154/7vQUAw3CX60dhzgzC7BQZFN7Y31.jpg"
    },
    {
      "title": "Together",
      "date": "2025-12-31",
      "platform": "Hulu",
      "synopsis": "With a move to the countryside already testing the limits of a couple’s relationship, a supernatural encounter begins an extreme transformation of their love, their lives, and their flesh.",
      "type": "streaming",
      "letterboxd_rating": 3.32,
      "letterboxd_url": "https://letterboxd.com/film/together-2025/",
      "poster": "https://image.tmdb.org/t/p/w154/m52XidzKx94bKlToZfEXUnL3pdy.jpg"
    },
    {
      "title": "Dracula",
      "date": "2026-01-02",
      "platform": "VOD/Digital",
      "synopsis": "A frustrated filmmaker, facing creative paralysis, turns to an A.I. chatbot in order to make his latest movie a hit. The result: a Dracula film made in Transylvania. What does it contain? A vampire hunt. Zombies and Dracula crashing a strike. A science-fiction story about Vlad the Impaler coming back. An adaptation of the first Romanian vampire novella. A love story. A montage reusing a classic vampire film. A vulgar folktale. AI-generated kitsch stories. And many delights in a film dealing with this cinema myth.",
      "type": "streaming",
      "letterboxd_rating": 3.55,
      "letterboxd_url": "https://letterboxd.com/film/dracula/",
      "poster": "https://image.tmdb.org/t/p/w154/hCKkybW6EfSZoOW3xia9ZsQwaUd.jpg"
    },
    {
      "title": "Peter Hujays Day",
      "date": "2026-01-06",
      "platform": "VOD/Digital",
      "synopsis": "A recently discovered conversation between photographer Peter Hujar and his friend Linda Rosenkrantz in 1974 reveals a glimpse into New York City’s downtown art scene and the personal struggles and epiphanies that define an artist’s life.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": null
    },
    {
      "title": "Zodiac Killer Project",
      "date": "2026-01-06",
      "platform": "VOD/Digital",
      "synopsis": "Against the backdrop of deserted spaces, a filmmaker explores his abandoned Zodiac Killer documentary, delving into the true crime genre’s inner workings at a saturation point.",
      "type": "streaming",
      "letterboxd_rating": 3.23,
      "letterboxd_url": "https://letterboxd.com/film/zodiac-killer-project/",
      "poster": null
    },
    {
      "title": "Chain Reactions",
      "date": "2026-01-09",
      "platform": "Shudder",
      "synopsis": "Fifty years after Tobe Hooper’s THE TEXAS CHAIN SAW MASSACRE shocked the world and forever changed the face of global cinema and popular culture, CHAIN REACTIONS charts the film’s profound impact and lasting influence.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": "https://letterboxd.com/film/chain-reactions/",
      "poster": null
    },
    {
      "title": "People We Meet On Vacation",
      "date": "2026-01-09",
      "platform": "Netflix",
      "synopsis": "Free-spirited Poppy and routine-loving Alex have been unlikely best friends for a decade, living in different cities but spending every summer vacation together. The careful balance of their friendship is put to the test when they begin to question what has been obvious to everyone else — could they actually be the perfect romantic match?",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": "https://letterboxd.com/film/people-we-meet-on-vacation/",
      "poster": "https://image.tmdb.org/t/p/w154/xzZaU0MN6L9oc1pl0RUXSB7hWwD.jpg"
    },
    {
      "title": "Bone Lake",
      "date": "2026-01-15",
      "platform": "Netflix",
      "synopsis": "A couple’s romantic vacation at a secluded lakeside estate is upended when they are forced to share the mansion with a mysterious and attractive couple. In this darkly hilarious and seductive horror story, a dream getaway spirals into a nightmarish maze of sex, lies, and manipulation, bringing terrifying secrets to light and triggering a bloody battle for survival.",
      "type": "streaming",
      "letterboxd_rating": 2.76,
      "letterboxd_url": "https://letterboxd.com/film/bone-lake/",
      "poster": "https://image.tmdb.org/t/p/w154/sGo5ti82LlydAZrvcsaj31iPuEI.jpg"
    },
    {
      "title": "Beast Of War",
      "date": "2026-01-16",
      "platform": "Shudder",
      "synopsis": "When their boat is sunk while crossing the Timor Sea during World War II, a young troop of Australian soldiers must find a way to survive the harsh seas on a quickly shrinking life raft. Hundreds of miles from anywhere, they must confront interpersonal conflicts, enemy attacks, and the advances of one very large, very hungry great white shark.",
      "type": "streaming",
      "letterboxd_rating": 2.87,
      "letterboxd_url": "https://letterboxd.com/film/beast-of-war/",
      "poster": "https://image.tmdb.org/t/p/w154/2xgDjVEOtu5LlbPEngxfbCqWEFg.jpg"
    },
    {
      "title": "Killer Whale",
      "date": "2026-01-16",
      "platform": "VOD/Digital",
      "synopsis": "Best friends Maddie and Trish find themselves trapped in a remote lagoon with a dangerous killer whale named Ceto.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": "https://letterboxd.com/film/killer-whale/",
      "poster": "https://image.tmdb.org/t/p/w154/kwD4xuRygWtlvFhJgEHPg7mE4Z9.jpg"
    },
    {
      "title": "The Rip",
      "date": "2026-01-16",
      "platform": "Netflix",
      "synopsis": "Upon discovering millions in cash in a derelict stash house, trust among a team of Miami cops begins to fray. As outside forces learn about the size of the seizure, everything is called into question — including who they can rely on.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": "https://letterboxd.com/film/the-rip-2026/",
      "poster": "https://image.tmdb.org/t/p/w154/cC3RawQQdjlUc0j1ULrURqs4bTh.jpg"
    },
    {
      "title": "Twinless",
      "date": "2026-01-16",
      "platform": "Hulu",
      "synopsis": "Two young men meet in a twin bereavement support group and form an unlikely bromance.",
      "type": "streaming",
      "letterboxd_rating": 3.81,
      "letterboxd_url": "https://letterboxd.com/film/twinless/",
      "poster": "https://image.tmdb.org/t/p/w154/9vaw9Az5tPLMjNLj426KgKsp0k8.jpg"
    },
    {
      "title": "Mother Of Flies",
      "date": "2026-01-23",
      "platform": "Shudder",
      "synopsis": "When a young woman faces a deadly diagnosis, she seeks dark magic from a witch in the woods – but every cure has costs.",
      "type": "streaming",
      "letterboxd_rating": 3.32,
      "letterboxd_url": "https://letterboxd.com/film/mother-of-flies/",
      "poster": "https://image.tmdb.org/t/p/w154/4DhSTu1VPTJ5HFdaT7IVUKzaFCg.jpg"
    },
    {
      "title": "Untitled Home Invasion Romance",
      "date": "2026-01-27",
      "platform": "VOD/Digital",
      "synopsis": "With his marriage on the rocks, Kevin (Jason Biggs) whisks his wife Suzie (Meaghan Rath) away on a romantic getaway with a wildly misguided plan: fake a break-in and play the hero. But when things spiral and someone turns up dead, Kevin finds himself at the center of a murder investigation, with lies piling up faster than the alibis.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": "https://letterboxd.com/film/untitled-home-invasion-romance/",
      "poster": "https://image.tmdb.org/t/p/w154/nohx0ptRAKk8OHd4wvo2FTk4PS6.jpg"
    },
    {
      "title": "The Wrecking Crew",
      "date": "2026-01-28",
      "platform": "Prime Video",
      "synopsis": "Two half-brothers, a loose cannon cop (Momoa) and a disciplined Navy SEAL (Bautista), must work together to unravel a conspiracy behind their father’s murder in Hawaii.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": "https://letterboxd.com/film/the-wrecking-crew-2026/",
      "poster": null
    },
    {
      "title": "Muzzle City Of Wolves",
      "date": "2026-01-30",
      "platform": "AMC+",
      "synopsis": "LAPD officer Jake Rosser endeavors to lead a peaceful life with his family and retired K-9 officer, Socks. However, tranquility dissolves into chaos when a gang targets them in a brutal attack. Alongside his new K-9 partner Argos, Jake launches into a relentless pursuit of justice, determined to protect his loved ones.",
      "type": "streaming",
      "letterboxd_rating": 2.82,
      "letterboxd_url": "https://letterboxd.com/film/muzzle-city-of-wolves/",
      "poster": "https://image.tmdb.org/t/p/w154/8qTMRmC07XCGidnKQFLbRM3FoDU.jpg"
    },
    {
      "title": "Tin Soldier",
      "date": "2026-01-30",
      "platform": "Hulu",
      "synopsis": "When the leader of a dangerous cult triggers a standoff with authorities, a former soldier returns to the compound he left many years prior to face down the man he used to follow and search for his missing wife.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": "https://letterboxd.com/film/tin-soldier/",
      "poster": null
    }
  ],
  "theatrical": [
    {
      "title": "Arco",
      "date": "2025-11-14",
      "platform": "Limited",
      "synopsis": "Arco, 12 years old, lives in a far future. During his first flight in his rainbow suit, he loses control and falls in the past. Iris, a little girl his age from 2075, saw him fall. She rescues him and tries by all means to send him back to his era.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/sV5B8qn4HhIPCKNFighAVMjKBtR.jpg",
      "tmdb_id": 804370,
      "letterboxd_rating": 3.98,
      "letterboxd_url": "https://letterboxd.com/film/arco/"
    },
    {
      "title": "The Secret Agent",
      "date": "2025-11-26",
      "platform": "Wide Release",
      "synopsis": "In 1977 Brazil, technology specialist Marcelo, fleeing a mysterious past, returns to Recife in search of peace, but realizes the city is far from the refuge he seeks.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/rZqolYhxMEe6TZZTjSmFw9crDTD.jpg",
      "tmdb_id": 1220564,
      "letterboxd_rating": 3.94,
      "letterboxd_url": "https://letterboxd.com/film/the-secret-agent-2025/"
    },
    {
      "title": "Hamnet",
      "date": "2025-11-26",
      "platform": "Wide Release",
      "synopsis": "The powerful story of love and loss that inspired the creation of Shakespeare's timeless masterpiece, Hamlet.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/71KNp6RiOQTbs8Fn1DagrFQrZmx.jpg",
      "tmdb_id": 858024,
      "letterboxd_rating": null,
      "letterboxd_url": "https://letterboxd.com/film/hamnet-2025/"
    },
    {
      "title": "H Is for Hawk",
      "date": "2025-11-26",
      "platform": "Limited",
      "synopsis": "After losing her beloved father, Helen finds herself saved by an unlikely friendship with a stubborn hawk named Mabel. Through the bond, Helen rediscovers the beauty of being alive.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/bGXjURum6d49cUVkYd6kOJqP0uZ.jpg",
      "tmdb_id": 1243006,
      "letterboxd_rating": 3.35,
      "letterboxd_url": "https://letterboxd.com/film/h-is-for-hawk/"
    },
    {
      "title": "Fackham Hall",
      "date": "2025-12-01",
      "platform": "Limited",
      "synopsis": "A new porter embarks on an unlikely relationship with the youngest daughter of a prominent English family. Simultaneously, rivalries are spilling over in the Davenport family, led by the Lord and Lady as they also weather the epic failure of the wedding of their eldest daughter to her caddish cousin.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/fwpdRe6WGmzqXFEJYJVepDQ6jrw.jpg",
      "tmdb_id": 1175174,
      "letterboxd_rating": 3.06,
      "letterboxd_url": "https://letterboxd.com/film/fackham-hall/"
    },
    {
      "title": "The Dreamer Cinderella",
      "date": "2025-12-01",
      "platform": "Limited",
      "synopsis": "This Cinderella story blends the emotional resonance of Under the Same Moon with the transformational charm of My Fair Lady. At its center is Xochitl, a Mexican-American street fruit vendor whose life takes an unexpected turn when a powerful film director makes her the subject of a daring bet with his career rival. Xochitl is thrust into a world she perceives as hostile. What follows is a clash of cultures—paving the way for new friendships, surprising rivalries, and life-altering consequences.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/bxCRBTqEa9T0UL7QuZs20QWNN9G.jpg",
      "tmdb_id": 1581486,
      "letterboxd_rating": null,
      "letterboxd_url": "https://letterboxd.com/film/the-dreamer-cinderella/"
    },
    {
      "title": "Hunting Season",
      "date": "2025-12-05",
      "platform": "Wide Release",
      "synopsis": "When a reclusive survivalist and his daughter rescue a mysterious, wounded woman from a river, they become entangled in a deadly web of violence and revenge, forcing them to confront a brutal criminal to survive.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/cbryTyaWdqrKpQCw6K7zm2jrB5v.jpg",
      "tmdb_id": 1387382,
      "letterboxd_rating": 2.88,
      "letterboxd_url": "https://letterboxd.com/film/hunting-season-2025/"
    },
    {
      "title": "Five Nights at Freddy's 2",
      "date": "2025-12-05",
      "platform": "Wide Release",
      "synopsis": "One year since the supernatural nightmare at Freddy Fazbear's Pizza, the stories about what transpired there have been twisted into a campy local legend, inspiring the town's first ever Fazfest. With the truth kept from her, Abby sneaks out to reconnect with Freddy, Bonnie, Chica, and Foxy, setting into motion a terrifying series of events that will reveal dark secrets about the real origin of Freddy's, and unleash a decades-hidden horror.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/udAxQEORq2I5wxI97N2TEqdhzBE.jpg",
      "tmdb_id": 1228246,
      "letterboxd_rating": 2.7,
      "letterboxd_url": "https://letterboxd.com/film/five-nights-at-freddys-2/"
    },
    {
      "title": "Dhurandhar",
      "date": "2025-12-05",
      "platform": "Wide Release",
      "synopsis": "An Indian intelligence mission unfolds over ten years as an undercover agent enters Karachi's criminal and political world to dismantle dangerous cross-border terror networks.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/8FHOtUpNIk5ZPEay2N2EY5lrxkv.jpg",
      "tmdb_id": 1291608,
      "letterboxd_rating": 3.73,
      "letterboxd_url": "https://letterboxd.com/film/dhurandhar/"
    },
    {
      "title": "JUJUTSU KAISEN: Execution -Shibuya Incident x The Culling Game Begins-",
      "date": "2025-12-05",
      "platform": "Wide Release",
      "synopsis": "A veil abruptly descends over the busy Shibuya area amid the bustling Halloween crowds, trapping countless civilians inside. Satoru Gojo, the strongest jujutsu sorcerer, steps into the chaos. But lying in wait are curse users and spirits scheming to seal him away. Yuji Itadori, accompanied by his classmates and other top-tier jujutsu sorcerers, enters the fray in an unprecedented clash of curses — the Shibuya Incident. In the aftermath, ten colonies across Japan are transformed into dens of curses in a plan orchestrated by Noritoshi Kamo. As the deadly Culling Game starts, Special Grade sorcerer Yuta Okkotsu is assigned to carry out Yuji's execution for his perceived crimes. A compilation movie of Shibuya Incident including the first two episodes of the Culling Games arc.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/tc7RrVW5FGvyO2tsgW6LIN1esHI.jpg",
      "tmdb_id": 1539104,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "Speed Train",
      "date": "2025-12-05",
      "platform": "Limited",
      "synopsis": "When a futuristic train journey turns chaotic due to a tech genius's malevolent hacking of brain-implanted passengers, a group of disparate travelers must band together to regain control, confronting not only immediate dangers but also the darker implications of unchecked technology.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/d6LkmLq2DcDIu1ctygYINGMMyUR.jpg",
      "tmdb_id": 1543831,
      "letterboxd_rating": null,
      "letterboxd_url": "https://letterboxd.com/film/speed-train/"
    },
    {
      "title": "La Grazia",
      "date": "2025-12-05",
      "platform": "Limited",
      "synopsis": "President Mariano De Santis' term is coming to an end. Disparagingly nicknamed 'Cemento armato' (reinforced concrete) for his intractable nature and overly careful approach to politics, he has grown lonely in the echoing halls of the presidential palace, mourning the loss of his wife and listening to hip-hop. Before returning to civilian life, De Santis must make a series of bold decisions – a pair of presidential pardons and a groundbreaking policy bill – that will cement his legacy.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/d86ctnc1Kl9xZHJ1xBPcwTKmaGa.jpg",
      "tmdb_id": 1397364,
      "letterboxd_rating": 3.65,
      "letterboxd_url": "https://letterboxd.com/film/la-grazia/"
    },
    {
      "title": "My First of May",
      "date": "2025-12-05",
      "platform": "Limited",
      "synopsis": "When his chronically ill daughter reenters his life after a decade apart, a former squash champion must face old wounds and rediscover what it means to be a father in this emotional journey of love and redemption.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/qSmf26mEYNEv1UWwuaozLXIqUJG.jpg",
      "tmdb_id": 1071646,
      "letterboxd_rating": 3.01,
      "letterboxd_url": "https://letterboxd.com/film/my-first-of-may/"
    },
    {
      "title": "The Chronology of Water",
      "date": "2025-12-05",
      "platform": "Limited",
      "synopsis": "Growing up in an environment torn apart by violence and alcohol, a young woman finds her voice through the written word and her salvation as a swimmer.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/aqYIGdhDjWF1wKl2GTuRy1XtbkI.jpg",
      "tmdb_id": 524635,
      "letterboxd_rating": 3.4,
      "letterboxd_url": "https://letterboxd.com/film/the-chronology-of-water/"
    },
    {
      "title": "100 Nights of Hero",
      "date": "2025-12-05",
      "platform": "Limited",
      "synopsis": "When a charming house guest arrives at a remote castle, the delicate dynamic between a neglectful husband, his innocent bride Cherry and their devoted maid Hero is thrown into chaos.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/7OYSJJFU2E9iBGPfU9C9PM56APM.jpg",
      "tmdb_id": 1354518,
      "letterboxd_rating": 3.29,
      "letterboxd_url": "https://letterboxd.com/film/100-nights-of-hero/"
    },
    {
      "title": "The Lost Chapter: Yuki's Revenge",
      "date": "2025-12-05",
      "platform": "Limited",
      "synopsis": "Visionary director Quentin Tarantino had a dream of a Kill Bill chapter that never made it to the silver screen, a chapter known as \"Yuki's Revenge.\" Over twenty years later, Tarantino and Epic have come together to bring the story to life in Fortnite.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/dOMsyboGMCVgG3PAidO5EQ9sFKl.jpg",
      "tmdb_id": 1588237,
      "letterboxd_rating": 2.69,
      "letterboxd_url": "https://letterboxd.com/film/the-lost-chapter-yukis-revenge/"
    },
    {
      "title": "Frontier Crucible",
      "date": "2025-12-05",
      "platform": "Limited",
      "synopsis": "In 1870s Arizona Territory, a desperately needed wagon full of medical supplies falls victim to an Apache attack. The only man who can guide it through is Merrick Beckford, but in order to get there, he’ll need to enlist the help of a trio of dangerous outlaws hellbent on survival. When they accidentally kill an Apache scout, all bets are off, and survival is the name of the game.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/aRdbTNiklT1xsv6mk30ZXnkt0A1.jpg",
      "tmdb_id": 1379413,
      "letterboxd_rating": null,
      "letterboxd_url": "https://letterboxd.com/film/frontier-crucible/"
    },
    {
      "title": "Come Closer",
      "date": "2025-12-05",
      "platform": "Limited",
      "synopsis": "When Eden's brother tragically dies, her grief spirals into obsession after discovering his secret girlfriend.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/m1NwODWETL07QlMyNNmzK7M2RUd.jpg",
      "tmdb_id": 1290377,
      "letterboxd_rating": null,
      "letterboxd_url": "https://letterboxd.com/film/come-closer/"
    },
    {
      "title": "Merrily We Roll Along",
      "date": "2025-12-05",
      "platform": "Limited",
      "synopsis": "Franklin Shepard is a talented Broadway composer who abandons his theater career and all his friends in New York in order to produce films in Los Angeles. The story begins at the height of his Hollywood fame and moves backwards in time, showing snapshots of the most important moments in Frank’s life that shaped the man he is today. A live recording of the 2024 Tony Award-winning Broadway revival of Stephen Sondheim and George Furth's musical, filmed at the Hudson Theatre in New York City.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/8h3uNPMdQKr7ffwAjU0aURFqIK.jpg",
      "tmdb_id": 1306400,
      "letterboxd_rating": 4.05,
      "letterboxd_url": "https://letterboxd.com/film/merrily-we-roll-along-2025/"
    },
    {
      "title": "Rosemead",
      "date": "2025-12-05",
      "platform": "Limited",
      "synopsis": "In a race against time, an ailing woman discovers her teenage son's violent obsessions and must go to great lengths to protect him, and possibly others, in this portrait of a Chinese American family. Inspired by true events.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/uVilyfKrB5ZkhXh7MMaIaevzueR.jpg",
      "tmdb_id": 766520,
      "letterboxd_rating": 3.48,
      "letterboxd_url": "https://letterboxd.com/film/rosemead/"
    },
    {
      "title": "Man Finds Tape",
      "date": "2025-12-05",
      "platform": "Limited",
      "synopsis": "Pulled in by a series of strange and unexplainable video clips, a brother and sister team up to investigate the events captured in the footage, only to discover a shocking secret that’s overtaking their small-town Texas community.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/1WMaJEwwsw8ALCo1mRGjjTV5e8T.jpg",
      "tmdb_id": 1465986,
      "letterboxd_rating": 2.87,
      "letterboxd_url": "https://letterboxd.com/film/man-finds-tape/"
    },
    {
      "title": "Starbright",
      "date": "2025-12-05",
      "platform": "Limited",
      "synopsis": "A young woman becomes the guardian of a fallen star, which she must protect from dangerous forces with the help of a brave stranger.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/m1Zl07DNYeSyNcz9hf8hDsS2oB5.jpg",
      "tmdb_id": 662707,
      "letterboxd_rating": null,
      "letterboxd_url": "https://letterboxd.com/film/starbright/"
    },
    {
      "title": "Ballistic",
      "date": "2025-12-06",
      "platform": "Limited",
      "synopsis": "A mother who works for an ammunition manufacturing company is devastated when her son is killed in Afghanistan. Despair gives way to rage and a desire for revenge when she discovers it was a bullet from her factory that was responsible for her son’s death.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/v5U4bjOvlUIdRTzaNVFXMIhrofz.jpg",
      "tmdb_id": 1243741,
      "letterboxd_rating": null,
      "letterboxd_url": "https://letterboxd.com/film/ballistic-2025/"
    },
    {
      "title": "The Christmas Chronicles",
      "date": "2025-12-10",
      "platform": "Wide Release",
      "synopsis": "Siblings Kate and Teddy try to prove Santa Claus is real, but when they accidentally cause his sleigh to crash, they have to save Christmas.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/5Il2EMSF2KecrUKZPuen6BZmaCP.jpg",
      "tmdb_id": 527435,
      "letterboxd_rating": 2.96,
      "letterboxd_url": "https://letterboxd.com/film/the-christmas-chronicles/"
    },
    {
      "title": "Turbulence",
      "date": "2025-12-12",
      "platform": "Wide Release",
      "synopsis": "Young married couple Zach and Emmy decide to take a hot air balloon trip across the Italian Dolomites to rekindle their relationship. When they and pilot Harry are joined by a third passenger, Julia, events unfold in ways they could never imagine five thousand meters in the air.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/6PdAODwR9amGEq5ER42FsuzV7op.jpg",
      "tmdb_id": 1401778,
      "letterboxd_rating": null,
      "letterboxd_url": "https://letterboxd.com/film/turbulence-2025/"
    },
    {
      "title": "Dust Bunny",
      "date": "2025-12-12",
      "platform": "Wide Release",
      "synopsis": "Ten-year-old Aurora asks her hitman neighbor to kill the monster she believes ate her entire family. To protect her, he'll need to battle an onslaught of assassins while accepting the fact that some monsters are real.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/jMcT1Quf34qZWNNE1rAqep8f9DW.jpg",
      "tmdb_id": 1043197,
      "letterboxd_rating": 3.36,
      "letterboxd_url": "https://letterboxd.com/film/dust-bunny/"
    },
    {
      "title": "Silent Night, Deadly Night",
      "date": "2025-12-12",
      "platform": "Wide Release",
      "synopsis": "After witnessing his parents’ brutal murder on Christmas Eve, Billy transforms into a Killer Santa, delivering a yearly spree of calculated, chilling violence. This year, his blood-soaked mission collides with love, as a young woman challenges him to confront his darkness.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/xCdSd7NnRdnL8DGLVhI95WhUNoi.jpg",
      "tmdb_id": 801937,
      "letterboxd_rating": 3.02,
      "letterboxd_url": "https://letterboxd.com/film/silent-night-deadly-night-2025/"
    },
    {
      "title": "Ella McCay",
      "date": "2025-12-12",
      "platform": "Wide Release",
      "synopsis": "An idealistic young politician juggles familial issues and a challenging work life while preparing to take over the job of her mentor, the state’s longtime incumbent governor.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/iQCtK477yqp6xnHHrQG2P0lXoow.jpg",
      "tmdb_id": 1206008,
      "letterboxd_rating": 2.49,
      "letterboxd_url": "https://letterboxd.com/film/ella-mccay/"
    },
    {
      "title": "Resurrection",
      "date": "2025-12-12",
      "platform": "Wide Release",
      "synopsis": "In a future where humanity has surrendered its ability to dream in exchange for immortality, an outcast finds illusion, nightmarish visions, and beauty in an intoxicating world of his own making.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/wBXvXc7CoE1TCEL96VzMkMQKYG9.jpg",
      "tmdb_id": 878608,
      "letterboxd_rating": 3.94,
      "letterboxd_url": "https://letterboxd.com/film/resurrection-2025/"
    },
    {
      "title": "Not Without Hope",
      "date": "2025-12-12",
      "platform": "Limited",
      "synopsis": "A group of friends' fishing boat capsizes off the coast of Mexico and they're left alone stranded at sea and struggling for survival.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/w5WJMJ6DWPFK0Gx0Ongh0FZBAlK.jpg",
      "tmdb_id": 339849,
      "letterboxd_rating": 3.06,
      "letterboxd_url": "https://letterboxd.com/film/not-without-hope/"
    },
    {
      "title": "Scarlet",
      "date": "2025-12-12",
      "platform": "Limited",
      "synopsis": "After failing to avenge her father's murder, Princess Scarlet, wakes up in the \"Land of the Dead.\" In this world filled with madness, if she does not achieve her revenge against her nemesis and reach the \"No End Place,\" she will become \"Void\" and cease to exist. Can Scarlet find a way to live at the end of her endless journey?",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/f4ptIplTKUz80AcKpnHtdSxRKd4.jpg",
      "tmdb_id": 1406657,
      "letterboxd_rating": 2.99,
      "letterboxd_url": "https://letterboxd.com/film/scarlet-2025/"
    },
    {
      "title": "Little Trouble Girls",
      "date": "2025-12-12",
      "platform": "Limited",
      "synopsis": "16-year-old Lucia joins the Catholic school choir where she befriends senior Ana-Maria. During a choir retreat Lucia's attraction to a restoration worker creates tension with Ana-Maria and challenges her faith.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/etH5TJk18eua1i4xke8E2rYEpqB.jpg",
      "tmdb_id": 1019871,
      "letterboxd_rating": 3.58,
      "letterboxd_url": "https://letterboxd.com/film/little-trouble-girls/"
    },
    {
      "title": "Atropia",
      "date": "2025-12-12",
      "platform": "Limited",
      "synopsis": "When an aspiring actress in a military role-playing facility falls in love with a soldier cast as an insurgent, their unsimulated emotions threaten to derail the performance.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/lakMEaRHm0yVeRrJIitZnYh7Cyd.jpg",
      "tmdb_id": 1239288,
      "letterboxd_rating": 3.28,
      "letterboxd_url": "https://letterboxd.com/film/atropia/"
    },
    {
      "title": "Goodbye June",
      "date": "2025-12-12",
      "platform": "Limited",
      "synopsis": "Four siblings' lives change drastically when their ailing mother takes a turn for the worse over the holiday season.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/xJ4SNjqfS8DyCOoxK0KD3e1b2JB.jpg",
      "tmdb_id": 1435092,
      "letterboxd_rating": 3.34,
      "letterboxd_url": "https://letterboxd.com/film/goodbye-june/"
    },
    {
      "title": "One More Shot",
      "date": "2025-12-12",
      "platform": "Limited",
      "synopsis": "New Years Eve. 1999. Minnie discovers a bottle of time travelling tequila. Each shot takes her back to the start of the night - giving her a bottle’s worth of shots to win back her old flame Joe, and change the course of her millennium.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/5lYkkKgZxuafkpHkyyRazyHldth.jpg",
      "tmdb_id": 1242705,
      "letterboxd_rating": 3.09,
      "letterboxd_url": "https://letterboxd.com/film/one-more-shot-2025/"
    },
    {
      "title": "The Mysterious Gaze of the Flamingo",
      "date": "2025-12-12",
      "platform": "Limited",
      "synopsis": "As an unknown and deadly disease begins to spread, legend has it that it is transmitted between two men, through a simple glance, when they fall in love. While people are accusing her family, Lidia must find out whether this myth is real or not.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/xfPhni21LIEmuV8HiDfrLhcmTwr.jpg",
      "tmdb_id": 896096,
      "letterboxd_rating": 3.76,
      "letterboxd_url": "https://letterboxd.com/film/the-mysterious-gaze-of-the-flamingo/"
    },
    {
      "title": "Sholay",
      "date": "2025-12-12",
      "platform": "Limited",
      "synopsis": "After his family is slain by the notorious bandit Gabbar Singh, former Inspector Thakur Baldev Singh enlists low-level outlaws Jai and Veeru to capture Gabbar and seek revenge.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/ya9bwgqA4eNl5bQ9QqS0jcmRoBS.jpg",
      "tmdb_id": 12259,
      "letterboxd_rating": 3.91,
      "letterboxd_url": "https://letterboxd.com/film/sholay/"
    },
    {
      "title": "Lone Samurai",
      "date": "2025-12-12",
      "platform": "Limited",
      "synopsis": "A violent and reckless samurai is shipwrecked on a remote island left without an avenue for his rage. After undertaking a spiritual journey to appease his aggressive thoughts, he finds himself abducted by external demons taking the form of cannibals, putting his sense of reality and deadly talents to the test.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/lwKD20JbeZAX4BswSlWKpmB8Qke.jpg",
      "tmdb_id": 1546050,
      "letterboxd_rating": 3.12,
      "letterboxd_url": "https://letterboxd.com/film/lone-samurai/"
    },
    {
      "title": "David",
      "date": "2025-12-14",
      "platform": "Wide Release",
      "synopsis": "From the songs of his mother’s heart to the whispers of a faithful God, David’s story begins in quiet devotion. When the giant Goliath rises to terrorize a nation, a young shepherd armed with only a sling, a few stones, and unshakable faith steps forward. Pursued by power and driven by purpose, his journey tests the limits of loyalty, love, and courage—culminating in a battle not just for a crown, but for the soul of a kingdom.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/7lFG1WrCwAxBfyGK8ahlBVzXno7.jpg",
      "tmdb_id": 1167307,
      "letterboxd_rating": 3.23,
      "letterboxd_url": "https://letterboxd.com/film/david-2025/"
    },
    {
      "title": "The Voice of Hind Rajab",
      "date": "2025-12-17",
      "platform": "Limited",
      "synopsis": "January 29, 2024. Red Crescent volunteers receive an emergency call. A five-year old girl is trapped in a car under fire in Gaza, pleading for rescue. While trying to keep her on the line, they do everything they can to get an ambulance to her. Her name was Hind Rajab.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/fBcBY8kdBiPsRdtkbldwg3ThlyJ.jpg",
      "tmdb_id": 1480382,
      "letterboxd_rating": 4.33,
      "letterboxd_url": "https://letterboxd.com/film/the-voice-of-hind-rajab/"
    },
    {
      "title": "The Wizard Hunter: The Hunt for Evangelion Crowley",
      "date": "2025-12-18",
      "platform": "Limited",
      "synopsis": "A bounty hunter of lost masterpieces of any era, hired by a Swiss Art Collector is at the end of his tasks. But one last assignment will let him discover his hidden and dark legacy.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/lEfqr5rqP7SBjH2neuVPCGHuZkJ.jpg",
      "tmdb_id": 511243,
      "letterboxd_rating": null,
      "letterboxd_url": "https://letterboxd.com/film/the-wizard-hunter-the-hunt-for-evangelion-crowley/"
    },
    {
      "title": "Avatar: Fire and Ash",
      "date": "2025-12-19",
      "platform": "Wide Release",
      "synopsis": "In the wake of the devastating war against the RDA and the loss of their eldest son, Jake Sully and Neytiri face a new threat on Pandora: the Ash People, a violent and power-hungry Na'vi tribe led by the ruthless Varang. Jake's family must fight for their survival and the future of Pandora in a conflict that pushes them to their emotional and physical limits.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/gDVgC9jd917NdAcqBdRRDUYi4Tq.jpg",
      "tmdb_id": 83533,
      "letterboxd_rating": 3.69,
      "letterboxd_url": "https://letterboxd.com/film/avatar-fire-and-ash/"
    },
    {
      "title": "The Housemaid",
      "date": "2025-12-19",
      "platform": "Wide Release",
      "synopsis": "Trying to escape her past, Millie Calloway accepts a job as a live-in housemaid for the wealthy Nina and Andrew Winchester. But what begins as a dream job quickly unravels into something far more dangerous—a sexy, seductive game of secrets, scandal, and power.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/cWsBscZzwu5brg9YjNkGewRUvJX.jpg",
      "tmdb_id": 1368166,
      "letterboxd_rating": 3.16,
      "letterboxd_url": "https://letterboxd.com/film/the-housemaid-2025/"
    },
    {
      "title": "The SpongeBob Movie: Search for SquarePants",
      "date": "2025-12-19",
      "platform": "Wide Release",
      "synopsis": "Desperate to be a big guy, SpongeBob sets out to prove his bravery to Mr. Krabs by following The Flying Dutchman – a mysterious swashbuckling ghost pirate – on a seafaring adventure that takes him to the deepest depths of the deep sea, where no Sponge has gone before.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/n92wqmgHhMU0Mzc49AzRUhyhQ65.jpg",
      "tmdb_id": 991494,
      "letterboxd_rating": 2.77,
      "letterboxd_url": "https://letterboxd.com/film/the-spongebob-movie-search-for-squarepants/"
    },
    {
      "title": "Marty Supreme",
      "date": "2025-12-19",
      "platform": "Wide Release",
      "synopsis": "In 1950s New York City, Marty Mauser, a young man with a dream no one respects, goes to hell and back in pursuit of greatness.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/firAhZA0uQvRL2slp7v3AnOj0ZX.jpg",
      "tmdb_id": 1317288,
      "letterboxd_rating": 4.29,
      "letterboxd_url": "https://letterboxd.com/film/marty-supreme/"
    },
    {
      "title": "Is This Thing On?",
      "date": "2025-12-19",
      "platform": "Limited",
      "synopsis": "As their marriage quietly unravels, Alex faces middle age and an impending divorce, seeking new purpose in the New York comedy scene while Tess confronts the sacrifices she made for their family—forcing them to navigate co-parenting, identity, and whether love can take a new form.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/92laLBRtuyOm7l32XZJT7T6OXW1.jpg",
      "tmdb_id": 1140498,
      "letterboxd_rating": 3.57,
      "letterboxd_url": "https://letterboxd.com/film/is-this-thing-on-2025/"
    },
    {
      "title": "Teenage Mutant Ninja Turtles: Chrome Alone 2 - Lost in New Jersey",
      "date": "2025-12-19",
      "platform": "Limited",
      "synopsis": "When a mysterious toy company seeks to profit off the turtles' new hero status, the brothers follow the clues to New Jersey and make a shocking discovery in this all new original short.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/nfn3KUIXqX2iW2eKnB8THzu8VEp.jpg",
      "tmdb_id": 1488195,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "Father Mother Sister Brother",
      "date": "2025-12-24",
      "platform": "Limited",
      "synopsis": "Three stories concerning the relationships between adult children, their somewhat distant parent (or parents), and each other: a reclusive father visited by his grown children in the US, sisters visiting their novelist mother in Dublin, and adult twins called back to their Paris apartment to address a family tragedy.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/zewZA6sL52YSH8xIH4wbG5GadjV.jpg",
      "tmdb_id": 1159206,
      "letterboxd_rating": 3.27,
      "letterboxd_url": "https://letterboxd.com/film/father-mother-sister-brother/"
    },
    {
      "title": "The Plague",
      "date": "2025-12-24",
      "platform": "Limited",
      "synopsis": "A socially awkward tween endures the ruthless hierarchy at a water polo camp, his anxiety spiraling into psychological turmoil over the summer.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/e4aBtGkDgAbwcbT4TxW8kj7yCeq.jpg",
      "tmdb_id": 1370814,
      "letterboxd_rating": 3.78,
      "letterboxd_url": "https://letterboxd.com/film/the-plague-2025/"
    },
    {
      "title": "The Street Avenger",
      "date": "2025-12-24",
      "platform": "Limited",
      "synopsis": "When a young girl being raised by a single father loses him to gang violence she turns to law enforcement but they are no help. She tries to take the law into her own hands and finds out being a vigilante",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/rcFZLvQT6KxTjyYwMwePph2jxGV.jpg",
      "tmdb_id": 1066234,
      "letterboxd_rating": null,
      "letterboxd_url": "https://letterboxd.com/film/the-street-avenger/"
    },
    {
      "title": "No Other Choice",
      "date": "2025-12-25",
      "platform": "Wide Release",
      "synopsis": "After being laid off and humiliated by a ruthless job market, a veteran paper mill manager descends into violence in a desperate bid to reclaim his dignity.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/vc2S0dvgpsM0XfSiXZDMVkRCSSU.jpg",
      "tmdb_id": 639988,
      "letterboxd_rating": 4.17,
      "letterboxd_url": "https://letterboxd.com/film/no-other-choice-2025/"
    },
    {
      "title": "Anaconda",
      "date": "2025-12-25",
      "platform": "Wide Release",
      "synopsis": "A group of friends facing mid-life crises head to the rainforest with the intention of remaking their favorite movie from their youth, only to find themselves in a fight for their lives against natural disasters, giant snakes and violent criminals.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/5MDnvvkOqthhE5gQebzkcOhD1p5.jpg",
      "tmdb_id": 1234731,
      "letterboxd_rating": null,
      "letterboxd_url": "https://letterboxd.com/film/anaconda-2025/"
    },
    {
      "title": "Song Sung Blue",
      "date": "2025-12-25",
      "platform": "Wide Release",
      "synopsis": "Based on a true story, two down-on-their-luck musicians form a joyous Neil Diamond tribute band, proving it's never too late to find love and follow your dreams.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/3HsIAbHWbFDUbY2jfj4wqEjGC3b.jpg",
      "tmdb_id": 1371185,
      "letterboxd_rating": 3.28,
      "letterboxd_url": "https://letterboxd.com/film/song-sung-blue-2025/"
    },
    {
      "title": "The Testament of Ann Lee",
      "date": "2025-12-25",
      "platform": "Limited",
      "synopsis": "The extraordinary true legend of Ann Lee, founder of the devotional sect known as the Shakers.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/1wleWp6BCniE9RSeaUjUezwZdF8.jpg",
      "tmdb_id": 1401281,
      "letterboxd_rating": 3.59,
      "letterboxd_url": "https://letterboxd.com/film/the-testament-of-ann-lee/"
    },
    {
      "title": "The Choral",
      "date": "2025-12-25",
      "platform": "Limited",
      "synopsis": "Yorkshire, 1916. A choral society's male members enlist in World War I, leaving the demanding Dr. Guthrie to recruit teenagers. Together, they experience the joy of singing while the young men grapple with their impending conscription.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/bw7KPUX4RVk8wuMtPvKHcwXR3bE.jpg",
      "tmdb_id": 1262815,
      "letterboxd_rating": 3.02,
      "letterboxd_url": "https://letterboxd.com/film/the-choral/"
    },
    {
      "title": "#RUNSEOKJIN_EP.TOUR THE MOVIE",
      "date": "2025-12-27",
      "platform": "Limited",
      "synopsis": "Spanning 10 cities and 20 performances, the most thrilling moments of Jin's first solo fan concert world tour are now ready to unfold on the big screen. With \"challenge\" as its theme, the show sees \"Worldwide Handsome\" Jin bring his signature energy to the stage, laughing, singing, and completing missions with ARMY across five energetic rounds. From his first solo album, \"Happy,\" backed by a live band, to his second mini-album, \"Echo,\" and a special medley of BTS songs, the concert unfolds as a panorama of diverse music and emotion, captivating both eyes and ears.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/1GZ75yVI8KTT10IG2sEkxbY9rhr.jpg",
      "tmdb_id": 1575712,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "Apophis 2029",
      "date": "2025-12-30",
      "platform": "Limited",
      "synopsis": "On April 13, 2029, the asteroid Apophis will pass close enough to Earth, it will be below our satellites. It will dip below and pop back out.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/sAfEgcdWeSREos4KRKx1C3LMXSW.jpg",
      "tmdb_id": 1286030,
      "letterboxd_rating": null,
      "letterboxd_url": "https://letterboxd.com/film/apophis-2029/"
    },
    {
      "title": "The Animated Mind of Oliver Sacks",
      "date": "2026-01-01",
      "platform": "Limited",
      "synopsis": "An exploration of the life and work of Dr. Oliver Sacks, the world-renowned neurologist and author who transformed our understanding of the human mind.",
      "type": "theatrical",
      "poster": null,
      "tmdb_id": 1446424,
      "letterboxd_rating": null,
      "letterboxd_url": "https://letterboxd.com/film/the-animated-mind-of-oliver-sacks/"
    },
    {
      "title": "Maya & Samar",
      "date": "2026-01-01",
      "platform": "Limited",
      "synopsis": "Set in contemporary Athens, Maya and Samar tells the story of two young women from conflicting cultures whose brief yet torrid affair endangers the life of one, while propelling the other to instant online fame.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/AidpWrxXAPU9MDY908D7szpWKgK.jpg",
      "tmdb_id": 1513996,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "Black Men in Uniform",
      "date": "2026-01-01",
      "platform": "Limited",
      "synopsis": "Pata Seca  (1828), a man whose back bore the whip marks of his enslavers , whose eyes held the haunted memory of being forced to breed over 200 slave children in order to sustain his master’s plantation.  Men broken but unbowed, transformed from field hands into soldiers from the civil war to Vietnam.  This documentary weaves together authentic narratives from the 1800s, accompanied by original images and footage, highlighting the significant influence that Black men in uniform had in Hollywood and addressing ongoing relevant issues to date.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/8h9jc1dFtKkCCcv2jlz305OOxRa.jpg",
      "tmdb_id": 1461751,
      "letterboxd_rating": null,
      "letterboxd_url": "https://letterboxd.com/film/black-men-in-uniform/"
    },
    {
      "title": "Rough",
      "date": "2026-01-01",
      "platform": "Limited",
      "synopsis": "Struggling to finish a screenplay that's all but consumed him, an ambitious writer turns to his ex for inspiration, only to realize that the ending he's looking for may lie in the unresolved chapters of their own story.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/A5GPQmJ1EkFodQEduXwIKbo5O2u.jpg",
      "tmdb_id": 1544848,
      "letterboxd_rating": null,
      "letterboxd_url": "https://letterboxd.com/film/rough-2026/"
    },
    {
      "title": "The Woodster",
      "date": "2026-01-01",
      "platform": "Limited",
      "synopsis": "The Woodster",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/qSxmq8u4BTeuahvJZvrrUWApDW4.jpg",
      "tmdb_id": 1560008,
      "letterboxd_rating": null,
      "letterboxd_url": "https://letterboxd.com/film/the-woodster/"
    },
    {
      "title": "The Dutchman",
      "date": "2026-01-02",
      "platform": "Limited",
      "synopsis": "A successful black businessman, haunted by his crumbling marriage and identity crisis, is drawn into a psychological game of cat and mouse with a mysterious white woman he encounters on a New York subway.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/z6Vmg4iRNOtK2lMcp6jWz9DKL8q.jpg",
      "tmdb_id": 1180417,
      "letterboxd_rating": 3.23,
      "letterboxd_url": "https://letterboxd.com/film/the-dutchman/"
    },
    {
      "title": "We Bury the Dead",
      "date": "2026-01-02",
      "platform": "Limited",
      "synopsis": "After a catastrophic military disaster, the dead don't just rise - they hunt. Ava searches for her missing husband, but what she finds is far more terrifying.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/vWOALCjS3cANciJKkG0qV8k1izW.jpg",
      "tmdb_id": 1198984,
      "letterboxd_rating": 3.24,
      "letterboxd_url": "https://letterboxd.com/film/we-bury-the-dead/"
    },
    {
      "title": "The Mother and the Bear",
      "date": "2026-01-02",
      "platform": "Limited",
      "synopsis": "When her daughter falls into a temporary coma after an accident at her home in Winnipeg, Sara, an overbearing Korean mother travels from Seoul to Canada and vows to keep her daughter safe forever by catfishing a husband for her online.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/5gS0Jif1hIHhqhqLkur29tjdaOJ.jpg",
      "tmdb_id": 1192730,
      "letterboxd_rating": null,
      "letterboxd_url": "https://letterboxd.com/film/the-mother-and-the-bear/"
    },
    {
      "title": "Kidz Bop Live: The Concert Movie",
      "date": "2026-01-02",
      "platform": "Limited",
      "synopsis": "Join the KIDZ BOP Kids for a larger-than-life concert adventure featuring today’s biggest hits, including 'APT.', 'Pink Pony Club', and more. Get ready to sing, dance, and celebrate together as the theatre turns into your family’s very own dance floor!",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/gZOJaeufbcLbJwDrJvQFvR1fOdk.jpg",
      "tmdb_id": 1570472,
      "letterboxd_rating": null,
      "letterboxd_url": "https://letterboxd.com/film/kidz-bop-live-the-concert-movie/"
    },
    {
      "title": "The Lake City Way",
      "date": "2026-01-02",
      "platform": "Limited",
      "synopsis": "After a break-up, a fledgling rapper goes on a odyssey through his hometown.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/krzxwzV1mzJfFBdiHbtpdYt80KG.jpg",
      "tmdb_id": 1556242,
      "letterboxd_rating": null,
      "letterboxd_url": "https://letterboxd.com/film/the-lake-city-way/"
    },
    {
      "title": "Lupin the IIIRD: The Movie - The Immortal Bloodline",
      "date": "2026-01-04",
      "platform": "Limited",
      "synopsis": "After fending off a series of skilled assassins, gentleman thief Lupin III and his band of allies follow a strange invitation to an uncharted island. When their plane is shot down, the gang is stranded and soon hunted by the island’s inhabitants, past enemies, and a monstrous immortal being known as Muom, who threatens to destroy Lupin's legacy. As a deadly toxic fog settles over them, Lupin must confront his greatest enemy in his most daring escapade yet.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/oqipJVMlnXeDakXtINMeIAl341q.jpg",
      "tmdb_id": 1395140,
      "letterboxd_rating": 3.26,
      "letterboxd_url": "https://letterboxd.com/film/lupin-the-iiird-the-movie-the-immortal-bloodline/"
    },
    {
      "title": "Mr Calculator",
      "date": "2026-01-05",
      "platform": "Limited",
      "synopsis": "Man obsessed with mathematics and odds finds a secret formula to life and safety.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/oZ4scioltd3L8vQtWBwmRPLINYb.jpg",
      "tmdb_id": 1149598,
      "letterboxd_rating": null,
      "letterboxd_url": "https://letterboxd.com/film/mr-calculator/"
    },
    {
      "title": "Nicolás de Jesús' Now You See Me...",
      "date": "2026-01-08",
      "platform": "Limited",
      "synopsis": "Struggling fair owner Kesselring (Nicolás de Jesús) is given a unique opportunity to restore the fair to its former glory when his friend Dr. Goodkat (Fredy Roque) introduces him to Marcus Kelevra (Alexis Adrián), a man whose mysterious act will draw people back to the fair, at a deadly cost, and even sparking interest among his fellow fairgoers.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/z1nELGUselYiNhQy1Ksq2CHudD9.jpg",
      "tmdb_id": 1450771,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "Water Rites",
      "date": "2026-01-08",
      "platform": "Limited",
      "synopsis": "A couple takes a break from their work-a-day lives by spending the summer at a secluded lakefront community. After uncovering the locals' secrets, the couple's idyllic retreat quickly turns into something neither of them can return from.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/qVESnB0kP1Gk5J7TPC35xWal9t2.jpg",
      "tmdb_id": 1493223,
      "letterboxd_rating": null,
      "letterboxd_url": "https://letterboxd.com/film/water-rites/"
    },
    {
      "title": "Greenland 2: Migration",
      "date": "2026-01-09",
      "platform": "Wide Release",
      "synopsis": "Having found the safety of the Greenland bunker after the comet Clarke decimated the Earth, the Garrity family must now risk everything to embark on a perilous journey across the wasteland of Europe to find a new home.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/z2tqCJLsw6uEJ8nJV8BsQXGa3dr.jpg",
      "tmdb_id": 840464,
      "letterboxd_rating": null,
      "letterboxd_url": "https://letterboxd.com/film/greenland-2-migration/"
    },
    {
      "title": "Primate",
      "date": "2026-01-09",
      "platform": "Limited",
      "synopsis": "Home from college, Lucy reunites with family including pet chimp Ben. Ben contracts rabies during a pool party and turns aggressive. Lucy and friends barricade in pool, devising ways to survive the vicious chimp.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/z97hrgI5wbGbZvSVkBfAeBnFKAg.jpg",
      "tmdb_id": 1315303,
      "letterboxd_rating": 3.27,
      "letterboxd_url": "https://letterboxd.com/film/primate-2026/"
    },
    {
      "title": "All That's Left of You",
      "date": "2026-01-09",
      "platform": "Limited",
      "synopsis": "In the Occupied West Bank of the 1980s, a Palestinian teenager is swept into a protest that changes the course of his family's life. Reeling from its aftermath, his mother, Hanan, shares the story that led them to that fateful moment. Spanning seven decades, this epic drama traces the hopes and heartaches of one uprooted family, revealing not only the scars of displacement, but the unbreakable spirit of survival.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/8OTAu88K9r9wqlLXux1mbnHmyPF.jpg",
      "tmdb_id": 1219620,
      "letterboxd_rating": 4.11,
      "letterboxd_url": "https://letterboxd.com/film/all-thats-left-of-you/"
    },
    {
      "title": "OBEX",
      "date": "2026-01-09",
      "platform": "Limited",
      "synopsis": "Conor Marsh lives a secluded life with his dog, Sandy, until one day he begins playing OBEX, a new, state-of-the-art computer game. When Sandy goes missing, the line between reality and game blurs and Conor must venture into the strange world of OBEX to bring her home.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/c6p4GSZ7kmRnpQmSDCEjTOk0sG4.jpg",
      "tmdb_id": 1212461,
      "letterboxd_rating": 3.31,
      "letterboxd_url": "https://letterboxd.com/film/obex/"
    },
    {
      "title": "I Was a Stranger",
      "date": "2026-01-09",
      "platform": "Limited",
      "synopsis": "A Syrian doctor and her daughter flee Aleppo, setting off a chain of events that binds five strangers together. A smuggler, a soldier, a poet, and a coast guard captain collide in a crisis that tests their courage, their choices, and their humanity.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/RBIrEveMOIy5Kxg2WzgMnCIhaN.jpg",
      "tmdb_id": 1193128,
      "letterboxd_rating": null,
      "letterboxd_url": "https://letterboxd.com/film/i-was-a-stranger/"
    },
    {
      "title": "Dead Man's Wire",
      "date": "2026-01-09",
      "platform": "Limited",
      "synopsis": "Set in 1977 and based on a true story, Tony Kiritsis, a former real estate developer puts a dead man's switch on himself and the mortgage banker who did him wrong, demanding $5 million and a personal apology.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/8nwiRUHjFfEwGUTFWBZIoqGrlMu.jpg",
      "tmdb_id": 1263012,
      "letterboxd_rating": 3.59,
      "letterboxd_url": "https://letterboxd.com/film/dead-mans-wire/"
    },
    {
      "title": "Sleepwalker",
      "date": "2026-01-09",
      "platform": "Limited",
      "synopsis": "A grieving mother is haunted by the tragic loss of her daughter in a car accident that left her abusive husband in a coma. As she battles a surreal descent into darkness, her sleepwalking episodes intensify. Plagued by haunting visions of her husband inside their home, she grapples with the blurred lines between reality and nightmare.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/760SP4VsZagpyB9WLfeZykE3DFg.jpg",
      "tmdb_id": 1432306,
      "letterboxd_rating": null,
      "letterboxd_url": "https://letterboxd.com/film/sleepwalker-2026/"
    },
    {
      "title": "Magellan",
      "date": "2026-01-09",
      "platform": "Limited",
      "synopsis": "In the 16th century, Ferdinand Magellan, a young and ambitious Portuguese navigator, rebels against the power of the King of Portugal, who doesn’t support his dream of discovering the world, and persuades the Spanish monarchy to fund his bold expedition to the fabled lands of the East.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/kA5trayJ6UICmTvSGrtWRftNRUJ.jpg",
      "tmdb_id": 975335,
      "letterboxd_rating": 2.87,
      "letterboxd_url": "https://letterboxd.com/film/magellan/"
    },
    {
      "title": "Oscar Shaw",
      "date": "2026-01-09",
      "platform": "Limited",
      "synopsis": "After retiring from the police force, a relentless detective haunted by the tragic loss of his closest friend sets out on a perilous quest for vengeance, seeking redemption and fighting to restore justice to the streets he once swore to protect.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/g0CvHRHJV5PBiDqHvOKxHomLWqZ.jpg",
      "tmdb_id": 1601243,
      "letterboxd_rating": null,
      "letterboxd_url": "https://letterboxd.com/film/oscar-shaw/"
    },
    {
      "title": "Gundam Wing: The Endless Waltz",
      "date": "2026-01-12",
      "platform": "Limited",
      "synopsis": "After Colony (A.C.) 196, one year following the end of the battles between the Earth Sphere and the space colonies, peace has spread throughout. The Gundam pilots find themselves attempting to rebuild their lives. No longer having need of their weapons of war, their Gundams are sent into the sun to be destroyed. But suddenly, Relena Darlian, now a high-ranking government official, is kidnapped by a colony with aspirations of total dominance. The pilots and their allies find themselves called into action once again. The Endless Waltz has resumed...",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/xbnN0pQwbveJnMi7xKkUEX8rjbr.jpg",
      "tmdb_id": 22914,
      "letterboxd_rating": 3.51,
      "letterboxd_url": "https://letterboxd.com/film/gundam-wing-the-endless-waltz/"
    },
    {
      "title": "Mobile Suit Gundam: Iron-Blooded Orphans 10th Anniversary Short Film - Wedge of Interposition",
      "date": "2026-01-12",
      "platform": "Limited",
      "synopsis": "A new animated short celebrating the 10th anniversary of Mobile Suit Gundam: Iron-Blooded Orphans, shown alongside the upcoming Mobile Suit Gundam: Iron-Blooded Orphans Urðr Hunt Path of the Little Challenger",
      "type": "theatrical",
      "poster": null,
      "tmdb_id": 1531600,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "Mobile Suit Gundam: Iron-Blooded Orphans - Urdr-Hunt: Path of the Little Challenger",
      "date": "2026-01-12",
      "platform": "Limited",
      "synopsis": "An animated spinoff from the Mobile Suit Gundam: Iron-Blooded Orphans, this feature length film compiles the ONA footage from the \"Mobile Suit Gundam: Iron-Blooded Orphans – Urðr Hunt\" mobile game.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/gMV6uyLhflWTxvAwsmjwUuvHYEG.jpg",
      "tmdb_id": 1520936,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "28 Years Later: The Bone Temple",
      "date": "2026-01-16",
      "platform": "Limited",
      "synopsis": "Dr. Kelson finds himself in a shocking new relationship - with consequences that could change the world as they know it - and Spike's encounter with Jimmy Crystal becomes a nightmare he can't escape.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/r9JPGoCtlMfhy47gtFs1wUMX2mB.jpg",
      "tmdb_id": 1272837,
      "letterboxd_rating": null,
      "letterboxd_url": "https://letterboxd.com/film/28-years-later-the-bone-temple/"
    },
    {
      "title": "A Useful Ghost",
      "date": "2026-01-16",
      "platform": "Limited",
      "synopsis": "After dying from a respiratory disease, a mother's spirit possesses a vacuum cleaner to protect her husband when he begins showing the same symptoms.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/9evMHDxDFw0x8KFAIbC0xvCtySa.jpg",
      "tmdb_id": 1364904,
      "letterboxd_rating": 3.66,
      "letterboxd_url": "https://letterboxd.com/film/a-useful-ghost/"
    },
    {
      "title": "Sound of Falling",
      "date": "2026-01-16",
      "platform": "Limited",
      "synopsis": "Over the course of a century, as four girls from different time periods experience their youth on a German farm, their lives become intertwined until time seems to dissolve.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/5hLiXAqZ3xTHExOIsxYANIswBjZ.jpg",
      "tmdb_id": 1221061,
      "letterboxd_rating": 3.64,
      "letterboxd_url": "https://letterboxd.com/film/sound-of-falling/"
    },
    {
      "title": "A Private Life",
      "date": "2026-01-16",
      "platform": "Limited",
      "synopsis": "Following the death of Paula, one of her long-time patients, psychiatrist Lilian Steiner becomes convinced that her supposed death by suicide is actually an unsolved murder.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/AnZ9XzhouSSvQH337923RPFTaqK.jpg",
      "tmdb_id": 1290432,
      "letterboxd_rating": null,
      "letterboxd_url": "https://letterboxd.com/film/a-private-life/"
    },
    {
      "title": "Killer Whale",
      "date": "2026-01-16",
      "platform": "Limited",
      "synopsis": "Best friends Maddie and Trish find themselves trapped in a remote lagoon with a dangerous killer whale named Ceto.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/kwD4xuRygWtlvFhJgEHPg7mE4Z9.jpg",
      "tmdb_id": 1412598,
      "letterboxd_rating": null,
      "letterboxd_url": "https://letterboxd.com/film/killer-whale/"
    },
    {
      "title": "Night Patrol",
      "date": "2026-01-16",
      "platform": "Limited",
      "synopsis": "An L.A. cop discovers a local task force is hiding a secret that puts the residents of his childhood neighborhood in danger.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/rNqLzACU9ez2ehDalTFDPjZiC4G.jpg",
      "tmdb_id": 1323625,
      "letterboxd_rating": 2.54,
      "letterboxd_url": "https://letterboxd.com/film/night-patrol/"
    },
    {
      "title": "Charlie the Wonderdog",
      "date": "2026-01-16",
      "platform": "Limited",
      "synopsis": "Timid nine year old Danny teams up with his beloved family dog Charlie, who gets abducted by aliens and returns with superpowers, to thwart a plan by the neighbor's sinister cat Puddy to destroy humanity.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/whvkL0wzxgKmVbaPontq9NlVd5z.jpg",
      "tmdb_id": 1276521,
      "letterboxd_rating": null,
      "letterboxd_url": "https://letterboxd.com/film/charlie-the-wonderdog/"
    },
    {
      "title": "B-Roll",
      "date": "2026-01-16",
      "platform": "Limited",
      "synopsis": "A disgraced local TV news reporter enlists the help of a wannabe journalist and a career film student to produce a documentary to revive his career.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/qlNM5aMJebqqi2Qx1AVtBAw1c.jpg",
      "tmdb_id": 424853,
      "letterboxd_rating": null,
      "letterboxd_url": "https://letterboxd.com/film/b-roll/"
    },
    {
      "title": "ALL YOU NEED IS KILL",
      "date": "2026-01-16",
      "platform": "Limited",
      "synopsis": "When a massive alien flower known as \"Darol\" unexpectedly erupts in a deadly event, unleashing monstrous creatures that decimate the population of Japan, Rita is caught in the destruction—and killed. But then she wakes up again. And again. Caught in an endless time loop, Rita must navigate the trauma and repetition of death until she crosses paths with Keiji, a shy young man trapped in the same cycle. Together, they fight to break free from the loop and find meaning in the chaos around them.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/y8mUXNllYasEJ37IsZaLrrR2yaW.jpg",
      "tmdb_id": 1432547,
      "letterboxd_rating": null,
      "letterboxd_url": "https://letterboxd.com/film/all-you-need-is-kill/"
    },
    {
      "title": "Signing Tony Raymond",
      "date": "2026-01-16",
      "platform": "Limited",
      "synopsis": "A young college football coach is sent to rural Alabama to try and sign the nation's top high school defensive end and soon finds himself trying to outflank rival recruiters, fight off grifting townsfolk and win over the player's wildly dysfunctional family.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/hqdP3i97vefXDlBVp8bfepW3IPU.jpg",
      "tmdb_id": 1555571,
      "letterboxd_rating": null,
      "letterboxd_url": "https://letterboxd.com/film/signing-tony-raymond/"
    },
    {
      "title": "Leave",
      "date": "2026-01-16",
      "platform": "Limited",
      "synopsis": "Architect Jesse Hughes uproots his wife and their two kids to an old house in the countryside, in the middle of nowhere, to try to piece back together an almost broken marriage. But Keith later finds that sometimes a change is not always the best solution when they get some unexpected visitors in their new home.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/7HjVWBntzWRdNu8GudupAQGQYoB.jpg",
      "tmdb_id": 1532688,
      "letterboxd_rating": null,
      "letterboxd_url": "https://letterboxd.com/film/leave-2026/"
    },
    {
      "title": "Shadow Dancing in the West",
      "date": "2026-01-20",
      "platform": "Limited",
      "synopsis": "When their father’s death forces them back to their family ranch to spread his ashes, two estranged brothers dance around their troubled past until a strange object falls from the sky.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/orsfoRL9ZipPmMGFrjlrCcsW6Ue.jpg",
      "tmdb_id": 1323570,
      "letterboxd_rating": null,
      "letterboxd_url": "https://letterboxd.com/film/shadow-dancing-in-the-west/"
    },
    {
      "title": "Tox",
      "date": "2026-01-21",
      "platform": "Limited",
      "synopsis": "Follows a perfection-obsessed woman who, after decades of transforming herself, eagerly returns to her high school reunion— convinced that her newfound beauty will rewrite her past and win the validation she believes will fix her life.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/vRnZ0x7rFXv3jLdDWfJMnG7cs0S.jpg",
      "tmdb_id": 1451998,
      "letterboxd_rating": null,
      "letterboxd_url": "https://letterboxd.com/film/tox/"
    },
    {
      "title": "National Theatre Live: Hamlet",
      "date": "2026-01-22",
      "platform": "Limited",
      "synopsis": "Olivier Award-winner Hiran Abeysekera (Life of Pi) is Hamlet in this fearless, contemporary take on Shakespeare’s famous tragedy.  Trapped between duty and doubt, surrounded by power and privilege, young Prince Hamlet dares to ask the ultimate question–you know the one.  National Theatre Deputy Artistic Director, Robert Hastie (Standing at the Sky’s Edge, Operation Mincemeat) directs this sharp, stylish and darkly funny reimagining.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/dBjvFG5F4CZlu6fbUkD0qV0hxPj.jpg",
      "tmdb_id": 1507580,
      "letterboxd_rating": null,
      "letterboxd_url": "https://letterboxd.com/film/national-theatre-live-hamlet-2026/"
    },
    {
      "title": "Megadeth: Behind the Mask",
      "date": "2026-01-22",
      "platform": "Limited",
      "synopsis": "Dave Mustaine reveals 40 years of Megadeth history and premieres their final album in a special event featuring career-spanning interviews and track-by-track commentary on this landmark release.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/au25ugceCljDxu8wEWyrjnYH6Ym.jpg",
      "tmdb_id": 1596092,
      "letterboxd_rating": null,
      "letterboxd_url": "https://letterboxd.com/film/megadeth-behind-the-mask/"
    },
    {
      "title": "Mercy",
      "date": "2026-01-23",
      "platform": "Limited",
      "synopsis": "In the near future, a detective stands on trial accused of murdering his wife. He has 90 minutes to prove his innocence to the advanced A.I. Judge he once championed, before it determines his fate.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/1LzdlxK9ctsnx7nXoGF1ImHKddl.jpg",
      "tmdb_id": 1236153,
      "letterboxd_rating": null,
      "letterboxd_url": "https://letterboxd.com/film/mercy-2026/"
    },
    {
      "title": "Return to Silent Hill",
      "date": "2026-01-23",
      "platform": "Limited",
      "synopsis": "When James receives a mysterious letter from his lost love Mary, he is drawn to Silent Hill—a once-familiar town now consumed by darkness. As he searches for her, James faces monstrous creatures and unravels a terrifying truth that will push him to the edge of his sanity.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/kfqUgLhYNrqEixcC60LBjAPH4fZ.jpg",
      "tmdb_id": 680493,
      "letterboxd_rating": null,
      "letterboxd_url": "https://letterboxd.com/film/return-to-silent-hill/"
    },
    {
      "title": "In Cold Light",
      "date": "2026-01-23",
      "platform": "Limited",
      "synopsis": "Fresh out of prison, Ava's attempt to reclaim her drug operation collapses when she witnesses a brutal crime, forcing her to flee into a nightmarish underworld where allies are scarce and enemies multiply by the minute.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/rfudugD3s3VqGoavq05EKXOphEj.jpg",
      "tmdb_id": 1128377,
      "letterboxd_rating": 3.28,
      "letterboxd_url": "https://letterboxd.com/film/in-cold-light/"
    },
    {
      "title": "Clika",
      "date": "2026-01-23",
      "platform": "Limited",
      "synopsis": "Aspiring small-town musician Chito is determined to make it big. When a clip of him performing one of his songs goes viral, he seizes the opportunity and pushes to carve out a place for himself in the new wave of Mexican-American music... and ultimately gets caught in a game more dangerous than anticipated.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/82Vh8PSzWtBi0CLWrnJdRhGYxEr.jpg",
      "tmdb_id": 1450257,
      "letterboxd_rating": null,
      "letterboxd_url": "https://letterboxd.com/film/clika/"
    },
    {
      "title": "Standout: The Ben Kjar Story",
      "date": "2026-01-23",
      "platform": "Limited",
      "synopsis": "Standout tells the powerful story of Ben Kjar, born with Crouzon Syndrome, a rare craniofacial disorder. From birth, doctors warn that his life will be overshadowed by limitations. Ben yearns for an ordinary life free from the harsh scrutiny he faces daily.  However, each experience of adversity, including relentless bullying and a series of painful surgeries, ignites a fire within him. Wrestling becomes his proving ground, a place where he learns to transform his facial difference into a source of power. Determined to succeed, he pushes himself relentlessly, breaking through physical, social, and even romantic barriers that once seemed insurmountable. But as unexpected challenges arise and ridicule resurfaces, Ben finds himself at a defining crossroads: fade into the background of a “normal” life, or fully embrace his unique path and boldly stand out.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/6jUG8yfFkSkJTj467lDmRVvFj4o.jpg",
      "tmdb_id": 1235409,
      "letterboxd_rating": null,
      "letterboxd_url": "https://letterboxd.com/film/standout-the-ben-kjar-story/"
    },
    {
      "title": "The Worm",
      "date": "2026-01-25",
      "platform": "Limited",
      "synopsis": "A young man’s strange belief sparks an intervention from his family.",
      "type": "theatrical",
      "poster": null,
      "tmdb_id": 1600761,
      "letterboxd_rating": null,
      "letterboxd_url": "https://letterboxd.com/film/the-worm-2026/"
    },
    {
      "title": "Valencia - Chapter III: Sabadell",
      "date": "2026-01-26",
      "platform": "Limited",
      "synopsis": "Third entry in The Valencia Saga.  A sitter got hired to take care an overprotected grown teen. While both discussing the up beats of life, their night turns more creepier than just a sitter chat.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/e2NfoXFg952Kq8kszoGK5TmtYUU.jpg",
      "tmdb_id": 1453554,
      "letterboxd_rating": null,
      "letterboxd_url": "https://letterboxd.com/film/valencia-chapter-iii-sabadell/"
    }
  ]
}