{
  "last_updated": "2026-01-27T10:19:25.244124",
  "months": [
    {
      "name": "January",
      "year": 2026
    },
    {
      "name": "February",
      "year": 2026
    }
  ],
  "releases": [
    {
      "title": "The Long Walk",
      "date": "2026-01-01",
      "platform": "Starz",
      "synopsis": "In a dystopian near-future, 100 teenage boys must embark on an annual competitive test known as “The Long Walk”. The rules are simple: maintain a speed above 4 miles per hour. Receive three warnings in an hour and you’re shot dead. The last one walking gets whatever he wants for the rest of his life. Under these grim circumstances the boys develop deep friendships despite knowing that each of their friends’ survival is a threat to their own.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": "https://image.tmdb.org/t/p/w154/wobVTa99eW0ht6c1rNNzLkazPtR.jpg"
    },
    {
      "title": "The Unbreakable Boy",
      "date": "2026-01-01",
      "platform": "Starz",
      "synopsis": "Austin is a boy with both a rare brittle-bone disease and autism. But what makes Austin truly unique is his joyous, funny, life-affirming worldview that transforms and unites everyone around him.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": null
    },
    {
      "title": "Dracula",
      "date": "2026-01-02",
      "platform": "VOD/Digital",
      "synopsis": "A frustrated filmmaker, facing creative paralysis, turns to an A.I. chatbot in order to make his latest movie a hit. The result: a Dracula film made in Transylvania. What does it contain? A vampire hunt. Zombies and Dracula crashing a strike. A science-fiction story about Vlad the Impaler coming back. An adaptation of the first Romanian vampire novella. A love story. A montage reusing a classic vampire film. A vulgar folktale. AI-generated kitsch stories. And many delights in a film dealing with this cinema myth.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": "https://image.tmdb.org/t/p/w154/ykyRfv7JDofLxXLAwtLXaSuaFfM.jpg"
    },
    {
      "title": "Hallow Road",
      "date": "2026-01-06",
      "platform": "VOD/Digital",
      "synopsis": "Two parents receive a distressing late-night call from their teenage daughter, who has just accidentally hit a pedestrian. They jump in their car, racing to get there before anyone else stumbles across the scene. As they head deeper into the night, disturbing revelations threaten to tear the family apart as they soon realise they might not be the only ones driving down Hallow Road.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": null
    },
    {
      "title": "Not Without Hope",
      "date": "2026-01-06",
      "platform": "VOD/Digital",
      "synopsis": "A group of friends’ fishing boat capsizes off the coast of Mexico and they’re left alone stranded at sea and struggling for survival.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": "https://image.tmdb.org/t/p/w154/evnbvmkoon2YTjlAodCwSmfU8Od.jpg"
    },
    {
      "title": "Predator Badlands",
      "date": "2026-01-06",
      "platform": "VOD/Digital",
      "synopsis": "In the future on a remote planet, a young Predator outcast from his clan finds an unlikely ally in Thia and embarks on a treacherous journey in search of the ultimate adversary.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": "https://image.tmdb.org/t/p/w154/pHpq9yNUIo6aDoCXEBzjSolywgz.jpg"
    },
    {
      "title": "Zodiac Killer Project",
      "date": "2026-01-06",
      "platform": "VOD/Digital",
      "synopsis": "Against the backdrop of deserted spaces, a filmmaker explores his abandoned Zodiac Killer documentary, delving into the true crime genre’s inner workings at a saturation point.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": "https://image.tmdb.org/t/p/w154/x1ZOSia1JA6SnRyokBOoVje2L67.jpg"
    },
    {
      "title": "Good Night And Good Luck Live From Broadway",
      "date": "2026-01-07",
      "platform": "Netflix",
      "synopsis": "George Clooney’s Tony-nominated, box-office record-breaking Broadway play chronicling a time in American history when legendary newsman Edward R. Murrow took an on-air stand against a growing tide of fearmongering and disinformation—and won.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": "https://image.tmdb.org/t/p/w154/fINjqjQNWYr7g9nVawzPDenxVO3.jpg"
    },
    {
      "title": "Tron Ares",
      "date": "2026-01-07",
      "platform": "Disney+",
      "synopsis": "A highly sophisticated Program called Ares is sent from the digital world into the real world on a dangerous mission, marking humankind’s first encounter with A.I. beings.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": "https://image.tmdb.org/t/p/w154/chpWmskl3aKm1aTZqUHRCtviwPy.jpg"
    },
    {
      "title": "Soul On Fire",
      "date": "2026-01-08",
      "platform": "Netflix",
      "synopsis": "After a horrific accident leaves his body scarred, a young boy strives to live and show everyone what is possible with the help of his family, his faith, his community, his longtime idol’s kindness, and the entire city of St. Louis.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": null
    },
    {
      "title": "The Toxic Avenger",
      "date": "2026-01-08",
      "platform": "Hulu",
      "synopsis": "A horrible toxic accident transforms downtrodden janitor Winston Gooze into a new evolution of hero: THE TOXIC AVENGER! Now wielding a glowing mop with super-human strength, he must race against time to save his son and stop a ruthless and power-hungry tyrant bent on harnessing toxic superpowers to strengthen his polluted empire.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": "https://image.tmdb.org/t/p/w154/cCWojb6N9UcTzNVtS4bOM3vQ30x.jpg"
    },
    {
      "title": "Chain Reactions",
      "date": "2026-01-09",
      "platform": "Shudder",
      "synopsis": "Fifty years after Tobe Hooper’s THE TEXAS CHAIN SAW MASSACRE shocked the world and forever changed the face of global cinema and popular culture, CHAIN REACTIONS charts the film’s profound impact and lasting influence.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": null
    },
    {
      "title": "People We Meet On Vacation",
      "date": "2026-01-09",
      "platform": "Netflix",
      "synopsis": "Free-spirited Poppy and routine-loving Alex have been unlikely best friends for a decade, living in different cities but spending every summer vacation together. The careful balance of their friendship is put to the test when they begin to question what has been obvious to everyone else — could they actually be the perfect romantic match?",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": "https://image.tmdb.org/t/p/w154/kOrJqRyt1pklNgDwJMjzN1GuNXS.jpg"
    },
    {
      "title": "Dust Bunny",
      "date": "2026-01-13",
      "platform": "VOD/Digital",
      "synopsis": "An eight-year-old girl asks her scheming neighbor for help in killing the monster under her bed that she thinks ate her family.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": "https://image.tmdb.org/t/p/w154/vobigFZFvbYPf6ElYJu07P9rH8C.jpg"
    },
    {
      "title": "Rebuilding",
      "date": "2026-01-13",
      "platform": "VOD/Digital",
      "synopsis": "A gently humanist story of the American West from Max Walker-Silverman (A Love Song), Rebuilding follows Dusty (Josh O’Connor), a reserved, divorced father whose ranch has burned down in a devastating wildfire. Now living in a trailer community on a government-run campsite, Dusty finds solace with his new neighbors who have also lost everything, quietly reassembles his life, and starts reconnecting with his ex-wife Ruby (Meghann Fahy) and young daughter Callie-Rose (Lily LaTorre). Filmed against the rapturous backdrop of southern Colorado, Rebuilding is a ruminative, moving portrait of resilience and human connection in the wake of loss.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": "https://image.tmdb.org/t/p/w154/7cDCGKBA6XANFDw4km9GvDnFBHw.jpg"
    },
    {
      "title": "Rental Family",
      "date": "2026-01-13",
      "platform": "VOD/Digital",
      "synopsis": "A lonely, down and out American actor living in Tokyo starts working for a Japanese “rental family” company to play various stand-in roles in other people’s lives. Along the way, he discovers unexpected joys within his built-in family.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": "https://image.tmdb.org/t/p/w154/A5lswNlytTUrnMWsuD0NFfhZlf3.jpg"
    },
    {
      "title": "The Running Man",
      "date": "2026-01-13",
      "platform": "Paramount+, MGM+",
      "synopsis": "Set in an oppressive future where the government controls the media, Ben Richards volunteers to participate in a deadly game show, which will see him hunted by professional killers over 30 days. Should he survive, he’ll win a cash prize that will help save his sick child and lift his family out of a horrid living situation.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": "https://image.tmdb.org/t/p/w154/dKL78O9zxczVgjtNcQ9UkbYLzqX.jpg"
    },
    {
      "title": "Song Sung Blue",
      "date": "2026-01-13",
      "platform": "VOD/Digital",
      "synopsis": "Based on a true story, two down-on-their-luck musicians (Hugh Jackman and Kate Hudson) form a joyous Neil Diamond tribute band, proving it’s never too late to find love and follow your dreams.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": "https://image.tmdb.org/t/p/w154/kQzDdxI0F5z16qo2vzDoqdVMl4O.jpg"
    },
    {
      "title": "Bone Lake",
      "date": "2026-01-15",
      "platform": "Netflix",
      "synopsis": "A couple’s romantic vacation at a secluded lakeside estate is upended when they are forced to share the mansion with a mysterious and attractive couple. In this darkly hilarious and seductive horror story, a dream getaway spirals into a nightmarish maze of sex, lies, and manipulation, bringing terrifying secrets to light and triggering a bloody battle for survival.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": "https://image.tmdb.org/t/p/w154/sGo5ti82LlydAZrvcsaj31iPuEI.jpg"
    },
    {
      "title": "Beast Of War",
      "date": "2026-01-16",
      "platform": "Shudder",
      "synopsis": "When their boat is sunk while crossing the Timor Sea during World War II, a young troop of Australian soldiers must find a way to survive the harsh seas on a quickly shrinking life raft. Hundreds of miles from anywhere, they must confront interpersonal conflicts, enemy attacks, and the advances of one very large, very hungry great white shark.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": "https://image.tmdb.org/t/p/w154/2xgDjVEOtu5LlbPEngxfbCqWEFg.jpg"
    },
    {
      "title": "Black Phone 2",
      "date": "2026-01-16",
      "platform": "Peacock",
      "synopsis": "Set several years after the events of the first film, The Black Phone 2 reunites us with survivors Finney and Gwen as they attempt to move forward. But the past refuses to stay buried. When a new string of disappearances strikes the area, it becomes clear that something—or someone—has returned. And the black phone? It’s ringing again.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": "https://image.tmdb.org/t/p/w154/gFddBLQ8wj9M9O82iPzgX5KVNHz.jpg"
    },
    {
      "title": "Killer Whale",
      "date": "2026-01-16",
      "platform": "VOD/Digital",
      "synopsis": "Best friends Maddie and Trish find themselves trapped in a remote lagoon with a dangerous killer whale named Ceto.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": "https://image.tmdb.org/t/p/w154/cqbXxAw9sUr4tJ5ffEwtnz6IL9o.jpg"
    },
    {
      "title": "Plainclothes",
      "date": "2026-01-16",
      "platform": "MUBI US",
      "synopsis": "A promising undercover officer assigned to lure and arrest gay men defies professional orders when he falls in love with a target.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": "https://image.tmdb.org/t/p/w154/bT5QN5QARV5TblAt9jDVQQsnSec.jpg"
    },
    {
      "title": "The Rip",
      "date": "2026-01-16",
      "platform": "Netflix",
      "synopsis": "Upon discovering millions in cash in a derelict stash house, trust among a team of Miami cops begins to fray. As outside forces learn about the size of the seizure, everything is called into question — including who they can rely on.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": "https://image.tmdb.org/t/p/w154/p4bW2sJKAwcHuLpfoZK7Zo63osA.jpg"
    },
    {
      "title": "Twinless",
      "date": "2026-01-16",
      "platform": "Hulu",
      "synopsis": "Two young men meet in a twin bereavement support group and form an unlikely bromance.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": "https://image.tmdb.org/t/p/w154/9vaw9Az5tPLMjNLj426KgKsp0k8.jpg"
    },
    {
      "title": "A Big Bold Beautiful Journey",
      "date": "2026-01-17",
      "platform": "Netflix",
      "synopsis": "Some doors bring you to your past. Some doors lead you to your future. And some doors change everything. Sarah (Margot Robbie) and David (Colin Farrell) are single strangers who meet at a mutual friend’s wedding and soon, through a surprising twist of fate, find themselves on A Big Bold Beautiful Journey – a funny, fantastical, sweeping adventure together where they get to re-live important moments from their respective pasts, illuminating how they got to where they are in the present…and possibly getting a chance to alter their futures.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": "https://image.tmdb.org/t/p/w154/uMAkmQlKthQpTMiyPAKOYK3JnMs.jpg"
    },
    {
      "title": "Little Trouble Girls",
      "date": "2026-01-20",
      "platform": "VOD/Digital",
      "synopsis": "At her mother’s urging, introverted 16-year-old Lucia joins her Catholic school’s all-girls choir, where she befriends Ana-Maria, a popular older student. When the choir travels to a countryside convent for a weekend retreat of intensive rehearsals, Lucia navigates the unfamiliar surroundings, complex teenage social structures, and her own awakening sexuality. A series of initiations, including an eye-opening experience with a handsome construction worker, test Lucia’s friendship with Ana-Maria and the other girls, as she begins to question her beliefs and disrupt the harmony within the choir.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": "https://image.tmdb.org/t/p/w154/etH5TJk18eua1i4xke8E2rYEpqB.jpg"
    },
    {
      "title": "Merrily We Roll Along",
      "date": "2026-01-20",
      "platform": "VOD/Digital",
      "synopsis": "Spanning three decades, Stephen Sondheim and George Furth’s Merrily We Roll Along charts the turbulent relationship between composer Franklin Shepard and his two lifelong friends — writer Mary and lyricist & playwright Charley. Originally produced on Broadway in 1981, then becoming an inventive cult-classic ahead of its time, Merrily We Roll Along features some of Stephen Sondheim’s most celebrated and personal songs.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": "https://image.tmdb.org/t/p/w154/8h3uNPMdQKr7ffwAjU0aURFqIK.jpg"
    },
    {
      "title": "Savage Flowers",
      "date": "2026-01-20",
      "platform": "Screambox",
      "synopsis": "Set in a world ravaged by a deadly infection carried by children, a young orphan finds sanctuary in a crumbling foster home. But she soon learns the real danger isn’t the infected world outside—it’s the girls she’s trapped inside with, each harboring dark secrets.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": null
    },
    {
      "title": "The Spongebob Move Search For Squarepants",
      "date": "2026-01-20",
      "platform": "VOD/Digital",
      "synopsis": "SpongeBob travels to the depths of the ocean and faces off against the ghost of the Flying Dutchman.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": null
    },
    {
      "title": "Vincent Must Die",
      "date": "2026-01-20",
      "platform": "VOD/Digital",
      "synopsis": "Random strangers have suddenly started attacking Vincent with murderous intent in this nerve-shredding, ground-breaking movie riding the new wave of French horror. Vincent’s existence as a completely unremarkable man is overturned, and as things spiral violently out of control, he is forced to change his life completely.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": null
    },
    {
      "title": "Mr Nobody Against Putin",
      "date": "2026-01-22",
      "platform": "VOD/Digital",
      "synopsis": "As Russia launches its full-scale invasion of Ukraine, primary schools across Russia’s hinterlands are transformed into recruitment stages for the war. Facing the ethical dilemma of working in a system defined by propaganda and violence, a brave teacher goes undercover to film what’s really happening in his own school.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": "https://image.tmdb.org/t/p/w154/aXCEnrqecvPXohuptN0JRgIvkDj.jpg"
    },
    {
      "title": "Gabbys Dollhouse The Movie",
      "date": "2026-01-23",
      "platform": "Peacock",
      "synopsis": "Gabby heads out on a road trip with her Grandma Gigi to the urban wonderland of Cat Francisco. But when Gabby’s dollhouse, her most prized possession, ends up in the hands of an eccentric cat lady named Vera, Gabby sets off on an adventure through the real world to get the Gabby Cats back together and save the dollhouse before it’s too late.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": "https://image.tmdb.org/t/p/w154/t6LLguAmu6iZUN8pWhT7Q0IcaQ5.jpg"
    },
    {
      "title": "Mother Of Flies",
      "date": "2026-01-23",
      "platform": "Shudder",
      "synopsis": "When a young woman faces a deadly diagnosis, she seeks dark magic from a witch in the woods – but every cure has costs.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": "https://image.tmdb.org/t/p/w154/wGsZCpd0UWnU0YP5iRMB3qtIm1G.jpg"
    },
    {
      "title": "The Smashing Machine",
      "date": "2026-01-23",
      "platform": "HBO Max",
      "synopsis": "MMA fighter Mark Kerr struggles with addiction, winning and love during his peak era in the UFC.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": "https://image.tmdb.org/t/p/w154/mPuBDGrVIBGOymBxR6rO3iIvBSe.jpg"
    },
    {
      "title": "Secret Mall Apartment",
      "date": "2026-01-23",
      "platform": "Netflix",
      "synopsis": "In 2003, eight Rhode Islanders created a secret apartment inside a busy mall and lived there for four years, filming everything along the way. Far more than a prank, the secret apartment became a deeply meaningful place for all involved.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": "https://image.tmdb.org/t/p/w154/nc6ZQMlQrCq03d1WXyYaeUXRlCY.jpg"
    },
    {
      "title": "Springsteen Deliver Me From Nowhere",
      "date": "2026-01-23",
      "platform": "Hulu",
      "synopsis": "Visionary musician Bruce Springsteen embarks on an emotional journey to record “Nebraska.”",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": "https://image.tmdb.org/t/p/w154/csBV3eq4RDjNg1acNQ8kwOZyPlZ.jpg"
    },
    {
      "title": "Eleanor The Great",
      "date": "2026-01-24",
      "platform": "Netflix",
      "synopsis": "94-year-old Eleanor Morgenstein tries to rebuild her life after the death of her best friend. As a result, she moves back to New York City after living in Florida for decades.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": "https://image.tmdb.org/t/p/w154/9XTM42IJST6lwPxtK2iUwNaFvCT.jpg"
    },
    {
      "title": "The Strangers Chapter 2",
      "date": "2026-01-24",
      "platform": "Starz",
      "synopsis": "On the final day of their cross country road trip, a couple’s vehicle breaks down, forcing them to take refuge in a remote Airbnb. As night falls, three masked strangers terrorize them until dawn.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": null
    },
    {
      "title": "Peter Hujays Day",
      "date": "2026-01-27",
      "platform": "The Criterion Channel",
      "synopsis": "A recently discovered conversation between photographer Peter Hujar and his friend Linda Rosenkrantz in 1974 reveals a glimpse into New York City’s downtown art scene and the personal struggles and epiphanies that define an artist’s life.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": null
    },
    {
      "title": "Anaconda",
      "date": "2026-01-27",
      "platform": "VOD/Digital",
      "synopsis": "A group of friends facing mid-life crises head to the rainforest with the intention of remaking their favorite movie from their youth, only to find themselves in a fight for their lives against natural disasters, giant snakes and violent criminals.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": "https://image.tmdb.org/t/p/w154/5MDnvvkOqthhE5gQebzkcOhD1p5.jpg"
    },
    {
      "title": "David",
      "date": "2026-01-27",
      "platform": "VOD/Digital",
      "synopsis": "From the songs of his mother’s heart to the whispers of a faithful God, David’s story begins in quiet devotion. When the giant Goliath rises to terrorize a nation, a young shepherd armed with only a sling, a few stones, and unshakable faith steps forward. Pursued by power and driven by purpose, his journey tests the limits of loyalty, love, and courage—culminating in a battle not just for a crown, but for the soul of a kingdom.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": "https://image.tmdb.org/t/p/w154/7lFG1WrCwAxBfyGK8ahlBVzXno7.jpg"
    },
    {
      "title": "Greenland 2 Migration",
      "date": "2026-01-27",
      "platform": "VOD/Digital",
      "synopsis": "In the aftermath of a comet strike that decimated most of the earth, Greenland 2: Migration follows the Garrity family (Gerard Butler, Morena Baccarin, and Roman Griffin Davis) as they’re forced to leave the safety of their bunker in Greenland to traverse a shattered world in search of a new home.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": "https://image.tmdb.org/t/p/w154/z2tqCJLsw6uEJ8nJV8BsQXGa3dr.jpg"
    },
    {
      "title": "Untitled Home Invasion Romance",
      "date": "2026-01-27",
      "platform": "VOD/Digital",
      "synopsis": "With his marriage on the rocks, Kevin (Jason Biggs) whisks his wife Suzie (Meaghan Rath) away on a romantic getaway with a wildly misguided plan: fake a break-in and play the hero. But when things spiral and someone turns up dead, Kevin finds himself at the center of a murder investigation, with lies piling up faster than the alibis.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": "https://image.tmdb.org/t/p/w154/aBMnVU5yrsP5XMBZhG8aT2w6m9u.jpg"
    },
    {
      "title": "The Wrecking Crew",
      "date": "2026-01-28",
      "platform": "Prime Video",
      "synopsis": "Two half-brothers, a loose cannon cop (Momoa) and a disciplined Navy SEAL (Bautista), must work together to unravel a conspiracy behind their father’s murder in Hawaii.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": "https://image.tmdb.org/t/p/w154/gbVwHl4YPSq6BcC92TQpe7qUTh6.jpg"
    },
    {
      "title": "Grizzly Night",
      "date": "2026-01-30",
      "platform": "VOD/Digital",
      "synopsis": "Based on true events, a rookie park ranger faces a terrifying night of grizzly attacks in Glacier National Park, leading stranded survivors through chaos and fear in a fight that forever changes America’s view of the wild.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": "https://image.tmdb.org/t/p/w154/3ppOwa6PEtGsIiDPdZHUbEqgIY7.jpg"
    },
    {
      "title": "If I Had Legs Id Kick You",
      "date": "2026-01-30",
      "platform": "HBO Max",
      "synopsis": "With her life crashing down around her, Linda (Rose Byrne) attempts to navigate her child’s mysterious illness, her absent husband, a missing person, and an increasingly hostile relationship with her therapist.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": "https://image.tmdb.org/t/p/w154/va0TQ9WprMXRqQAzY56vyqY0Yd5.jpg"
    },
    {
      "title": "Muzzle City Of Wolves",
      "date": "2026-01-30",
      "platform": "AMC+",
      "synopsis": "LAPD officer Jake Rosser endeavors to lead a peaceful life with his family and retired K-9 officer, Socks. However, tranquility dissolves into chaos when a gang targets them in a brutal attack. Alongside his new K-9 partner Argos, Jake launches into a relentless pursuit of justice, determined to protect his loved ones.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": "https://image.tmdb.org/t/p/w154/8qTMRmC07XCGidnKQFLbRM3FoDU.jpg"
    },
    {
      "title": "Peaches Goes Bananas",
      "date": "2026-01-30",
      "platform": "VOD/Digital",
      "synopsis": "For the past 17 years, Marie Losier has captured the dynamic and provocative essence of Peaches, the trailblazing feminist queer icon. This intimate portrait offers a deep dive into the life of an inspiring, taboo-shattering artist. Discover Peaches’ electrifying concerts, her close bond with her sister and how her boundless energy, fearless exploration on and off stage has transformed every phase of her life into a captivating work of art.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": null
    },
    {
      "title": "Tin Soldier",
      "date": "2026-01-30",
      "platform": "Hulu",
      "synopsis": "When the leader of a dangerous cult triggers a standoff with authorities, a former soldier returns to the compound he left many years prior to face down the man he used to follow and search for his missing wife.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": null
    },
    {
      "title": "Hurry Up Tomorrow",
      "date": "2026-02-01",
      "platform": "Starz",
      "synopsis": "A musician plagued by insomnia is pulled into an odyssey with a stranger who begins to unravel the very core of his existence.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": null
    },
    {
      "title": "The Knife",
      "date": "2026-02-01",
      "platform": "Starz",
      "synopsis": "All Chris wants is to build a promising future for his wife, Alex, and their two daughters—a young family chasing the American Dream. But one fateful night, their world is upended when a stranger mysteriously appears in their home. As tensions rise and unsettling revelations come to light, they must also face Detective Carlsen, whose relentless pursuit of the truth threatens to unravel everything.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": "https://image.tmdb.org/t/p/w154/wbmxnsv41vsg5UEaNDlf203dOWw.jpg"
    },
    {
      "title": "Love Brooklyn",
      "date": "2026-02-01",
      "platform": "Starz",
      "synopsis": "Three longtime Brooklynites navigate careers, love, loss, and friendship against the rapidly changing landscape of their beloved city.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": null
    },
    {
      "title": "The Housemaid",
      "date": "2026-02-03",
      "platform": "VOD/Digital",
      "synopsis": "Millie is a struggling woman who is relieved to get a fresh start as a housemaid to Nina and Andrew, an upscale, wealthy couple. She soon learns that the family’s secrets are far more dangerous than her own.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": "https://image.tmdb.org/t/p/w154/cWsBscZzwu5brg9YjNkGewRUvJX.jpg"
    },
    {
      "title": "Marty Supreme",
      "date": "2026-02-03",
      "platform": "VOD/Digital",
      "synopsis": "Marty Mauser, a young man with a dream no one respects, goes to hell and back in pursuit of greatness.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": "https://image.tmdb.org/t/p/w154/firAhZA0uQvRL2slp7v3AnOj0ZX.jpg"
    },
    {
      "title": "The Plague",
      "date": "2026-02-03",
      "platform": "VOD/Digital",
      "synopsis": "A socially awkward tween endures the ruthless hierarchy at a water polo camp, his anxiety spiraling into psychological turmoil over the summer.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": "https://image.tmdb.org/t/p/w154/s5oNGHGZLE1pIhspvOoTD8IQjAp.jpg"
    },
    {
      "title": "The Secret Agent",
      "date": "2026-02-03",
      "platform": "VOD/Digital",
      "synopsis": "Brazil, 1977. Marcelo, a technology expert in his early 40s, is on the run. He arrives in Recife during carnival week, hoping to reunite with his son but soon realizes that the city is far from being the non violent refuge he seeks.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": "https://image.tmdb.org/t/p/w154/iLE2YOmeboeTDC7GlOp1dzh1VFo.jpg"
    },
    {
      "title": "We Bury The Dead",
      "date": "2026-02-03",
      "platform": "VOD/Digital",
      "synopsis": "When her husband goes missing in the aftermath of a catastrophic military experiment, Ava joins a “body retrieval unit” in the hopes of finding him alive. But her search takes a chilling turn when the corpses she’s burying start showing signs of life.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": "https://image.tmdb.org/t/p/w154/vWOALCjS3cANciJKkG0qV8k1izW.jpg"
    },
    {
      "title": "Relationship Goals",
      "date": "2026-02-04",
      "platform": "Prime Video",
      "synopsis": "When brilliant TV producer Leah Caldwell (Kelly Rowland) is about to make history as the first woman to run New York’s top morning show, her ex Jarrett Roy (Clifford “Method Man” Smith) swoops in to compete for the same position. He claims he’s a changed man, transformed by the wisdom of the New York Times bestselling book ‘Relationship Goals.’ As her tight-knit circle of friends dive into the same life-changing book, they all begin to rediscover their aim in love. Yet Leah, laser-focused on breaking through the glass ceiling, isn’t ready to believe in finding love—even as her undeniable chemistry with her ex threatens to reignite old flames.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": "https://image.tmdb.org/t/p/w154/o7dVxvZIKnAB7k1eeeWp2k14Es7.jpg"
    },
    {
      "title": "Ella Mccay",
      "date": "2026-02-05",
      "platform": "Hulu",
      "synopsis": "An idealistic young politician juggles familial issues and a challenging work life while preparing to take over the job of her mentor, the state’s longtime incumbent governor.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": "https://image.tmdb.org/t/p/w154/iQCtK477yqp6xnHHrQG2P0lXoow.jpg"
    },
    {
      "title": "Boys Go To Jupiter",
      "date": "2026-02-06",
      "platform": "HBO Max",
      "synopsis": "It’s the day after Christmas in suburban Florida, and Billy 5000 (Jack Corbett) and his friends drift through the sun-bleached limbo between holidays by slacking, shoplifting, and beatboxing. In between sneaking into pools and zoning out on the beach, Billy hustles for tips on the food-on-demand app Grubster, determined to make exactly $5,000 before New Year’s Eve. As he zigzags across town on his hoverboard delivering fast food to a cast of oddball locals, a routine drop-off at the Dolphin Groves Juice Company leads to an unexpected reunion with Rozebud (Miya Folick), his childhood crush, and a mysterious alien creature named Donut that’s stowed away in his backpack. The surprise encounter sets off a surreal chain of events that puts Billy in the crosshairs of Dr. Dolphin (Janeane Garofalo), a ruthless juice mogul who will stop at nothing to reclaim her extraterrestrial property.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": null
    },
    {
      "title": "La Grazia",
      "date": "2026-02-06",
      "platform": "MUBI",
      "synopsis": "President Mariano De Santis’ term is coming to an end. Disparagingly nicknamed ‘Cemento armato’ (reinforced concrete) for his intractable nature and overly careful approach to politics, he has grown lonely in the echoing halls of the presidential palace, mourning the loss of his wife and listening to hip-hop. Before returning to civilian life, De Santis must make a series of bold decisions – a pair of presidential pardons and a groundbreaking policy bill – that will cement his legacy.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": "https://image.tmdb.org/t/p/w154/d86ctnc1Kl9xZHJ1xBPcwTKmaGa.jpg"
    },
    {
      "title": "Obex",
      "date": "2026-02-06",
      "platform": "VOD/Digital",
      "synopsis": "Conor Marsh lives a secluded life with his dog, Sandy, until one day he begins playing OBEX, a new, state-of-the-art computer game. When Sandy goes missing, the line between reality and game blurs and Conor must venture into the strange world of OBEX to bring her home.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": "https://image.tmdb.org/t/p/w154/989voQxc9qAJKuBaoBHngqnpLsD.jpg"
    },
    {
      "title": "Queen Of Chess",
      "date": "2026-02-06",
      "platform": "Netflix",
      "synopsis": "A Hungarian girl dreams of conquering international men’s chess. After a 15-year battle against world champion Garry Kasparov, Judit Polgár revolutionizes the sport’s patriarchal culture to become one of the greatest chess prodigies in history and the greatest woman chess player of all time.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": "https://image.tmdb.org/t/p/w154/ag5TZNcK3vHdCCpZIY8syjwzgfr.jpg"
    },
    {
      "title": "Splitsville",
      "date": "2026-02-06",
      "platform": "Hulu",
      "synopsis": "Ashley asks for a divorce, watching as the good-natured Carey runs to his friends, Julie and Paul, for support. He’s shocked to discover that the secret to their happiness is an open marriage; that is, until Carey crosses the line and throws all of their relationships into chaos.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": "https://image.tmdb.org/t/p/w154/gxCv6kUdywxYzIXX6xYcmX5APUV.jpg"
    },
    {
      "title": "Violent Ends",
      "date": "2026-02-06",
      "platform": "AMC+",
      "synopsis": "Lucas Frost, an honest man brought up in a crime family whose only legacy is violence, tries to make his own life with his fiancée, Emma. He is suddenly pulled back into the family business he so despises when his cousin, Eli, perpetrates an armed robbery on a local scrap yard and an innocent life is caught in the crossfire.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": null
    },
    {
      "title": "The Huntsman",
      "date": "2026-02-10",
      "platform": "VOD/Digital",
      "synopsis": "When an ICU nurse volunteers to help a coma patient accused of murdering six women, he’s drawn into a chilling web of lies, obsession, and deadly secrets as a detective races to stop the killer.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": "https://image.tmdb.org/t/p/w154/la1CvCbIaXj9Xd9BOSgEBM15uO0.jpg"
    },
    {
      "title": "Primate",
      "date": "2026-02-10",
      "platform": "VOD/Digital",
      "synopsis": "Home from college, Lucy reunites with family including pet chimp Ben. Ben contracts rabies during a pool party and turns aggressive. Lucy and friends barricade in pool, devising ways to survive the vicious chimp.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": "https://image.tmdb.org/t/p/w154/z97hrgI5wbGbZvSVkBfAeBnFKAg.jpg"
    },
    {
      "title": "Eternity",
      "date": "2026-02-13",
      "platform": "Apple TV",
      "synopsis": "In an afterlife where souls have one week to decide where to spend eternity, Joan is faced with the impossible choice between the man she spent her life with and her first love, who died young and has waited decades for her to arrive.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": "https://image.tmdb.org/t/p/w154/o8pg20G67BGmQvRkXwstNre062J.jpg"
    },
    {
      "title": "Honey Bunch",
      "date": "2026-02-13",
      "platform": "Shudder",
      "synopsis": "Diana’s husband is taking her to an experimental trauma facility deep in the wilderness, but she can’t remember why…. As her memories begin to creep back in so do some unwelcome sinister truths about her marriage.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": "https://image.tmdb.org/t/p/w154/rR6zS2sPpcjND92cCLmsuMNok7M.jpg"
    },
    {
      "title": "Tyler Perrys Joes College Road Trip",
      "date": "2026-02-13",
      "platform": "Netflix",
      "synopsis": "In an effort to teach him about the real world, Joe (Tyler Perry) takes B.J. (Jermaine Harris) on a cross-country college road trip where tensions get high but life-changing lessons are learned.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": "https://image.tmdb.org/t/p/w154/v5YCcj97kknZNtfe6gLRYLGCZgY.jpg"
    },
    {
      "title": "Urchin",
      "date": "2026-02-17",
      "platform": "Hulu",
      "synopsis": "Mike, a rough sleeper in London, trapped in a cycle of self-destruction as he attempts to turn his life around.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": "https://image.tmdb.org/t/p/w154/1a5upDGAScp2HL3vOyl2dGg6SeR.jpg"
    },
    {
      "title": "The Astronaut",
      "date": "2026-02-20",
      "platform": "Hulu",
      "synopsis": "After returning from her first space mission, astronaut Sam Walker is placed under NASA’s care at a high security house for rehabilitation and medical testing. However, when disturbing occurrences begin happening around the property, she fears that something extraterrestrial has followed her back to Earth.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": "https://image.tmdb.org/t/p/w154/souvvkJHYhztC1UqZ8lEVUiJa3J.jpg"
    },
    {
      "title": "Dead Of Winter",
      "date": "2026-02-20",
      "platform": "HBO Max",
      "synopsis": "A grief-stricken loner (Emma Thompson) caught in a brutal Minnesotan blizzard discovers a young woman imprisoned by a desperate armed couple, forcing this unlikely hero into a dangerous fight for her and the victim’s survival.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": "https://image.tmdb.org/t/p/w154/5DcrN62sGAiRJxt8rXSRlSRLwIE.jpg"
    },
    {
      "title": "The Dreadful",
      "date": "2026-02-20",
      "platform": "VOD/Digital",
      "synopsis": "Set in medieval England, Anne and her domineering mother-in-law Morwen struggle to survive on the outskirts of society. But when a man from Anne’s past returns from war, a curse begins to take shape through a mysterious knight and threatens to destroy them all.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": "https://image.tmdb.org/t/p/w154/As1SkUenVWlIZjiYnWZbMuzNRle.jpg"
    },
    {
      "title": "The Bluff",
      "date": "2026-02-25",
      "platform": "Prime Video",
      "synopsis": "Ercell “Bloody Mary” Bodden (Priyanka Chopra Jonas) thought she had escaped her violent past as a pirate, finding peace in the Cayman Islands with her loving husband T.H. (Ismael Cruz Cordova), their son Isaac (Vedanten Naidoo) and her sister-in-law Elizabeth (Safia Oakley-Green). But when her notorious former captain, Connor (Karl Urban), arrives seeking revenge, Ercell’s world is torn apart. Forced to confront the demons she’s tried to bury, Ercell is thrust back into a deadly game of secrets and survival. Armed with lethal swordsmanship, cunning traps, and a fierce will to protect those she loves, she wages a brutal war against Connor’s merciless crew. Ercell’s fight to save her family becomes a journey of redemption, as she reclaims her power and embraces the warrior she once was. Against the breathtaking backdrop of the Cayman Brac’s Skull Cave and towering bluffs, producers Anthony and Joe Russo present The Bluff; a gritty, adrenaline-fueled action-adventure about family, survival, and the indomitable strength of a mother’s love.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": "https://image.tmdb.org/t/p/w154/sojEzvfxR2DBcDSJyAisX8TWjov.jpg"
    },
    {
      "title": "In The Blink Of An Eye",
      "date": "2026-02-27",
      "platform": "Hulu",
      "synopsis": "Three storylines, spanning thousands of years, intersect and reflect on hope, connection and the circle of life.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": "https://image.tmdb.org/t/p/w154/cwUZz1ZGtf2zQUlOmTKa83XAcpU.jpg"
    },
    {
      "title": "Kiss Of The Spider Woman",
      "date": "2026-02-27",
      "platform": "Hulu",
      "synopsis": "Valentín, a political prisoner, shares a cell with Molina, a window dresser convicted of public indecency. The two form an unlikely bond as Molina recounts the plot of a Hollywood musical starring his favorite silver screen diva, Ingrid Luna.",
      "type": "streaming",
      "letterboxd_rating": null,
      "letterboxd_url": null,
      "poster": "https://image.tmdb.org/t/p/w154/c8zDeDq0Uatjly6Fh4ycmWuoLYy.jpg"
    }
  ],
  "theatrical": [
    {
      "title": "Cuming Out",
      "date": "2025-10-24",
      "platform": "Limited",
      "synopsis": "Kennedy’s desire for a heteronormative experience sees her embark on a one-night stand. What could possibly go wrong?",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/w5uGM1NXI0rzGekydA0bRdDPqcL.jpg",
      "tmdb_id": 1483495,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "Arco",
      "date": "2025-11-14",
      "platform": "Limited",
      "synopsis": "Arco, ten years old, lives in a far future. During his first flight in his rainbow suit, he loses control and falls in the past. Iris, a little girl his age from 2075, saw him fall. She rescues him and tries by all means to send him back to his era.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/sV5B8qn4HhIPCKNFighAVMjKBtR.jpg",
      "tmdb_id": 804370,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "Left-Handed Girl",
      "date": "2025-11-14",
      "platform": "Limited",
      "synopsis": "A mother and her two daughters move to Taipei to open a noodle stand at a vibrant night market, but family secrets and tradition test their fresh start.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/hfuxIKRCNsecLmoDdO0HJ1YUvv1.jpg",
      "tmdb_id": 999075,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "Sirāt",
      "date": "2025-11-14",
      "platform": "Wide Release",
      "synopsis": "A man and his son arrive at a rave lost in the mountains of Morocco. They are looking for Marina, their daughter and sister, who disappeared months ago at another rave. Driven by fate, they decide to follow a group of ravers in search of one last party, in hopes Marina will be there.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/bzBtsLi17rK4G6kDvOXfUZfAhca.jpg",
      "tmdb_id": 1151272,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "Kokuho",
      "date": "2025-11-14",
      "platform": "Wide Release",
      "synopsis": "Nagasaki, 1964: Following the death of his yakuza father, 15-year-old Kikuo is taken under the wing of a famous kabuki actor. Alongside Shunsuke, the actor’s only son, he decides to dedicate himself to this traditional form of theatre. For decades, the two young men grow and evolve together – and one will become the greatest Japanese master of the art of kabuki.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/egDmNUBcSvu6aqQPCfyd1UneCYr.jpg",
      "tmdb_id": 1379266,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "H Is for Hawk",
      "date": "2025-11-26",
      "platform": "Limited",
      "synopsis": "After losing her beloved father, Helen finds herself saved by an unlikely friendship with a stubborn hawk named Mabel. Through the bond, Helen rediscovers the beauty of being alive.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/brjbQSdxvXfXDLSRA26NH2Qa5gP.jpg",
      "tmdb_id": 1243006,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "The Chronology of Water",
      "date": "2025-12-05",
      "platform": "Limited",
      "synopsis": "Growing up in an environment torn apart by violence and alcohol, a young woman finds her voice through the written word and her salvation as a swimmer.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/a0myciW2wnVBOB1fnHLUOVgX0fD.jpg",
      "tmdb_id": 524635,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "Resurrection",
      "date": "2025-12-12",
      "platform": "Limited",
      "synopsis": "In a future where humanity has surrendered its ability to dream in exchange for immortality, an outcast finds illusion, nightmarish visions, and beauty in an intoxicating world of his own making.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/2kuh8g1JLwI5RAqATUhcAkyaLw3.jpg",
      "tmdb_id": 878608,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "Dead Man's Wire",
      "date": "2025-12-12",
      "platform": "Limited",
      "synopsis": "In 1977, former real estate developer Tony Kiritsis puts a dead man's switch on himself and the mortgage banker who did him wrong, demanding $5 million and a personal apology.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/71FPde8V7DbnAHgUZfwrpxPOFG6.jpg",
      "tmdb_id": 1263012,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "Scarlet",
      "date": "2025-12-12",
      "platform": "Wide Release",
      "synopsis": "After failing to avenge her father's murder, Princess Scarlet, wakes up in the \"Land of the Dead.\" In this world filled with madness, if she does not achieve her revenge against her nemesis and reach the \"No End Place,\" she will become \"Void\" and cease to exist. Can Scarlet find a way to live at the end of her endless journey?",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/f4ptIplTKUz80AcKpnHtdSxRKd4.jpg",
      "tmdb_id": 1406657,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "The Plague",
      "date": "2025-12-24",
      "platform": "Wide Release",
      "synopsis": "A socially awkward tween endures the ruthless hierarchy at a water polo camp, his anxiety spiraling into psychological turmoil over the summer.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/s5oNGHGZLE1pIhspvOoTD8IQjAp.jpg",
      "tmdb_id": 1370814,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "Father Mother Sister Brother",
      "date": "2025-12-24",
      "platform": "Wide Release",
      "synopsis": "Three stories concerning the relationships between adult children, their somewhat distant parent (or parents), and each other: a reclusive father visited by his grown children in the US, sisters visiting their novelist mother in Dublin, and adult twins called back to their Paris apartment to address a family tragedy.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/zewZA6sL52YSH8xIH4wbG5GadjV.jpg",
      "tmdb_id": 1159206,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "No Other Choice",
      "date": "2025-12-25",
      "platform": "Wide Release",
      "synopsis": "After being laid off and humiliated by a ruthless job market, a veteran paper mill manager descends into violence in a desperate bid to reclaim his dignity.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/sBpxTGLzKnvPSVtL5yQYpSxvKEb.jpg",
      "tmdb_id": 639988,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "The Testament of Ann Lee",
      "date": "2025-12-25",
      "platform": "Limited",
      "synopsis": "The extraordinary true legend of Ann Lee, founder of the devotional sect known as the Shakers.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/hU1frHnDwJQ3YDERVppxTLvHjc7.jpg",
      "tmdb_id": 1401281,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "We Bury the Dead",
      "date": "2026-01-02",
      "platform": "Limited",
      "synopsis": "After a catastrophic military disaster, the dead don't just rise—they hunt. The military insists they are harmless and slow-moving, offering hope to grieving families. But when Ava enters a quarantine zone searching for her missing husband, she uncovers the horrifying truth: the undead are growing more violent, more relentless, and more dangerous with every passing hour.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/vWOALCjS3cANciJKkG0qV8k1izW.jpg",
      "tmdb_id": 1198984,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "Lupin the IIIRD: The Movie - The Immortal Bloodline",
      "date": "2026-01-04",
      "platform": "Limited",
      "synopsis": "After fending off a series of skilled assassins, gentleman thief Lupin III and his band of allies follow a strange invitation to an uncharted island. When their plane is shot down, the gang is stranded and soon hunted by the island’s inhabitants, past enemies, and a monstrous immortal being known as Muom, who threatens to destroy Lupin's legacy. As a deadly toxic fog settles over them, Lupin must confront his greatest enemy in his most daring escapade yet.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/oqipJVMlnXeDakXtINMeIAl341q.jpg",
      "tmdb_id": 1395140,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "The Rajasaab",
      "date": "2026-01-08",
      "platform": "Wide Release",
      "synopsis": "A young heir embraces both his royal heritage and rebellious spirit as he rises to power, establishing unprecedented rules during his reign as Raja Saab.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/nvK6gYa4diCnQkDVN42uoYXPrdT.jpg",
      "tmdb_id": 1022453,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "Primate",
      "date": "2026-01-09",
      "platform": "Wide Release",
      "synopsis": "Lucy, a college student, along with her friends, spend their vacation at her family's home in Hawaii, which includes her pet chimpanzee, Ben. However, when Ben contracts rabies after being bitten by a rabid animal, the group must fight for their lives in order to avoid the now-violent chimp.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/z97hrgI5wbGbZvSVkBfAeBnFKAg.jpg",
      "tmdb_id": 1315303,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "Greenland 2: Migration",
      "date": "2026-01-09",
      "platform": "Wide Release",
      "synopsis": "Having found the safety of the Greenland bunker after the comet Clarke decimated the Earth, the Garrity family must now risk everything to embark on a perilous journey across the wasteland of Europe to find a new home.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/z2tqCJLsw6uEJ8nJV8BsQXGa3dr.jpg",
      "tmdb_id": 840464,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "Parasakthi",
      "date": "2026-01-09",
      "platform": "Wide Release",
      "synopsis": "In a time of civil disobedience in the erstwhile Madras state, a ruthless intelligent officer turns up with a duty to track down rebels. Chezhian and his brother Chinndurai are of different personalities, one a hardworking fireman, the other a rebel. A deadly game of cat and mouse ensues as Chezhian is forced to abandon his peaceful ways to protect his people and takes on the mighty forces, culminating in a fierce battle for justice.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/cpKJGYU8Z1iSXzkgDl8vhazk5EQ.jpg",
      "tmdb_id": 965483,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "All That's Left of You",
      "date": "2026-01-09",
      "platform": "Limited",
      "synopsis": "In the Occupied West Bank of the 1980s, a Palestinian teenager is swept into a protest that changes the course of his family's life. Reeling from its aftermath, his mother, Hanan, shares the story that led them to that fateful moment. Spanning seven decades, this epic drama traces the hopes and heartaches of one uprooted family, revealing not only the scars of displacement, but the unbreakable spirit of survival.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/8OTAu88K9r9wqlLXux1mbnHmyPF.jpg",
      "tmdb_id": 1219620,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "Call Me Mother",
      "date": "2026-01-09",
      "platform": "Limited",
      "synopsis": "Twinkle is a single queer mother whose dream of officially adopting her son gets shaken when the boy's biological mother, Mara, unexpectedly reappears.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/p0umaKN4HpuA8ynXNofbOuhz7ON.jpg",
      "tmdb_id": 1510688,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "OBEX",
      "date": "2026-01-09",
      "platform": "Limited",
      "synopsis": "Conor Marsh lives a secluded life with his dog, Sandy, until one day he begins playing OBEX, a new, state-of-the-art computer game. When Sandy goes missing, the line between reality and game blurs and Conor must venture into the strange world of OBEX to bring her home.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/989voQxc9qAJKuBaoBHngqnpLsD.jpg",
      "tmdb_id": 1212461,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "Oscar Shaw",
      "date": "2026-01-09",
      "platform": "Limited",
      "synopsis": "After retiring from the police force, a relentless detective haunted by the tragic loss of his closest friend sets out on a perilous quest for vengeance, seeking redemption and fighting to restore justice to the streets he once swore to protect.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/tsE3nySukwrfUjouz8vzvKTcXNC.jpg",
      "tmdb_id": 1601243,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "I Was a Stranger",
      "date": "2026-01-09",
      "platform": "Limited",
      "synopsis": "A Syrian doctor and her daughter flee Aleppo, setting off a chain of events that binds five strangers together. A smuggler, a soldier, a poet, and a coast guard captain collide in a crisis that tests their courage, their choices, and their humanity.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/4PsyWVELCnBHkocrj3rMeJcYQ7F.jpg",
      "tmdb_id": 1193128,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "Sleepwalker",
      "date": "2026-01-09",
      "platform": "Limited",
      "synopsis": "A grieving mother is haunted by the tragic loss of her daughter in a car accident that left her abusive husband in a coma. As she battles a surreal descent into darkness, her sleepwalking episodes intensify. Plagued by haunting visions of her husband inside their home, she grapples with the blurred lines between reality and nightmare.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/760SP4VsZagpyB9WLfeZykE3DFg.jpg",
      "tmdb_id": 1432306,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "Magellan",
      "date": "2026-01-09",
      "platform": "Limited",
      "synopsis": "In the 16th century, young and ambitious Portuguese navigator Fernão de Magalhães rebels against the power of King Manuel I, who doesn't support his dream of discovering the world. He persuades the Spanish Crown to fund his bold expedition to the fabled lands of the East. The voyage is exhausting beyond expectations, with hunger and mutiny pushing the crew to their limits. Upon reaching the islands of the Malayan Archipelago, Magalhães' mind changes. He becomes obsessed with conquest and conversion, which sparks violent uprisings beyond his control.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/kA5trayJ6UICmTvSGrtWRftNRUJ.jpg",
      "tmdb_id": 975335,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "Bulls",
      "date": "2026-01-09",
      "platform": "Limited",
      "synopsis": "Two down-on-their-luck half-brothers run a failing dive bar in Indiana and get a shot at taking on England’s elite darts champions.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/eBAb4Lw87b2xqZNgMOjZZEfT1rI.jpg",
      "tmdb_id": 1480860,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "Gundam Wing: The Endless Waltz",
      "date": "2026-01-12",
      "platform": "Wide Release",
      "synopsis": "After Colony (A.C.) 196, one year following the end of the battles between the Earth Sphere and the space colonies, peace has spread throughout. The Gundam pilots find themselves attempting to rebuild their lives. No longer having need of their weapons of war, their Gundams are sent into the sun to be destroyed. But suddenly, Relena Darlian, now a high-ranking government official, is kidnapped by a colony with aspirations of total dominance. The pilots and their allies find themselves called into action once again. The Endless Waltz has resumed...",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/xbnN0pQwbveJnMi7xKkUEX8rjbr.jpg",
      "tmdb_id": 22914,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "Mobile Suit Gundam: Iron-Blooded Orphans 10th Anniversary Short Film - Wedge of Interposition",
      "date": "2026-01-12",
      "platform": "Limited",
      "synopsis": "A new animated short celebrating the 10th anniversary of Mobile Suit Gundam: Iron-Blooded Orphans, shown alongside the upcoming Mobile Suit Gundam: Iron-Blooded Orphans Urðr Hunt Path of the Little Challenger",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/jP5TbH0mf47SVTW5NaGND4mkdFd.jpg",
      "tmdb_id": 1531600,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "Food Truck: Stolen Love... and Moo Deng",
      "date": "2026-01-14",
      "platform": "Wide Release",
      "synopsis": "Jake and Bobby, with the art director by the truck, don't know their vehicle will force Mamiew to face his past once more.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/fOhSmHSEm0iVQ2AdG5SkjXnsvUM.jpg",
      "tmdb_id": 1522496,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "Killer Whale",
      "date": "2026-01-16",
      "platform": "Wide Release",
      "synopsis": "Follows best friends Maddie and Trish as they find themselves trapped in a remote lagoon with the dangerous killer whale named Ceto.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/cqbXxAw9sUr4tJ5ffEwtnz6IL9o.jpg",
      "tmdb_id": 1412598,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "28 Years Later: The Bone Temple",
      "date": "2026-01-16",
      "platform": "Wide Release",
      "synopsis": "Dr. Kelson finds himself in a shocking new relationship - with consequences that could change the world as they know it - and Spike's encounter with Jimmy Crystal becomes a nightmare he can't escape.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/kK1BGkG3KAvWB0WMV1DfOx9yTMZ.jpg",
      "tmdb_id": 1272837,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "Sound of Falling",
      "date": "2026-01-16",
      "platform": "Wide Release",
      "synopsis": "Four adolescent girls each spend their youth in the same farmhouse over the last century. Though separated by decades, resonances between their lives emerge: their desires and distress, secrets and truths, encounters with another’s gaze and defiant gaze in return.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/bggoSnlqfhagCSwqg6Vf7JFwM2p.jpg",
      "tmdb_id": 1221061,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "A Private Life",
      "date": "2026-01-16",
      "platform": "Wide Release",
      "synopsis": "Following the death of Paula, one of her long-time patients, psychiatrist Lilian Steiner becomes convinced that her supposed death by suicide is actually an unsolved murder.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/AnZ9XzhouSSvQH337923RPFTaqK.jpg",
      "tmdb_id": 1290432,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "A Useful Ghost",
      "date": "2026-01-16",
      "platform": "Limited",
      "synopsis": "After dying from a respiratory disease, a mother's spirit possesses a vacuum cleaner to protect her husband when he begins showing the same symptoms.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/2PteNeb8LYFtZP7eowANUXs9feC.jpg",
      "tmdb_id": 1364904,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "Sheepdog",
      "date": "2026-01-16",
      "platform": "Limited",
      "synopsis": "A decorated combat Veteran is court ordered into treatment when an ex-convict shows up on his doorstep and reveals that he must put himself back together again.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/a5dezw0c6y7wzdFgDAE7bNrtZYr.jpg",
      "tmdb_id": 1359462,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "Night Patrol",
      "date": "2026-01-16",
      "platform": "Limited",
      "synopsis": "An L.A. cop discovers a local task force is hiding a secret that puts the residents of his childhood neighborhood in danger.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/rNqLzACU9ez2ehDalTFDPjZiC4G.jpg",
      "tmdb_id": 1323625,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "Charlie the Wonderdog",
      "date": "2026-01-16",
      "platform": "Limited",
      "synopsis": "Timid nine year old Danny teams up with his beloved family dog Charlie, who gets abducted by aliens and returns with superpowers, to thwart a plan by the neighbor's sinister cat Puddy to destroy humanity.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/whvkL0wzxgKmVbaPontq9NlVd5z.jpg",
      "tmdb_id": 1276521,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "Miss Moxy",
      "date": "2026-01-16",
      "platform": "Limited",
      "synopsis": "From the cobbled streets of Paris to the wild countryside of Europe, follow Miss Moxy — a pampered cat with a whole lot of cattitude — as she’s thrown into the adventure of a lifetime. Lost far from home, she must team up with a goofy dog and a wise old bird to find her way back… and discover who she truly is along the way.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/1evGutuoFIbK62RymPNKuMzT8EZ.jpg",
      "tmdb_id": 587357,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "ALL YOU NEED IS KILL",
      "date": "2026-01-16",
      "platform": "Limited",
      "synopsis": "When a massive alien flower known as \"Darol\" unexpectedly erupts in a deadly event, unleashing monstrous creatures that decimate the population of Japan, Rita is caught in the destruction—and killed. But then she wakes up again. And again. Caught in an endless time loop, Rita must navigate the trauma and repetition of death until she crosses paths with Keiji, a shy young man trapped in the same cycle. Together, they fight to break free from the loop and find meaning in the chaos around them.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/kznh3ACnXYVyyAYes7JN6i1wy2d.jpg",
      "tmdb_id": 1432547,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "B-Roll",
      "date": "2026-01-16",
      "platform": "Limited",
      "synopsis": "A disgraced local TV news reporter enlists the help of a wannabe journalist and a career film student to produce a documentary to revive his career.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/qlNM5aMJebqqi2Qx1AVtBAw1c.jpg",
      "tmdb_id": 424853,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "The Fire Raven",
      "date": "2026-01-18",
      "platform": "Limited",
      "synopsis": "A group of powerful and corrupt individuals of varying backgrounds turn Doma City into a 'hell island', where high schooler Xiaodi is brutally raped and murdered. Fifteen years later, these manipulators meet a series of gruesome deaths. Fang Tianyang, who witnessed the murders, and police officer Fang Zhengnan delve into the investigation, only to discover that this anonymous killing is not simply revenge, but a belated indictment. A series of murders, layers of darkness—how many untold sins lie hidden behind the black web woven by power, money, and desire?",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/wz7DchRv3sXIH87LyjhhxJdrVGk.jpg",
      "tmdb_id": 1530787,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "Mercy",
      "date": "2026-01-19",
      "platform": "Wide Release",
      "synopsis": "In the near future, a detective stands on trial accused of murdering his wife. He has ninety minutes to prove his innocence to the advanced AI Judge he once championed, before it determines his fate.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/pyok1kZJCfyuFapYXzHcy7BLlQa.jpg",
      "tmdb_id": 1236153,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "Zombie Land Saga: Yumeginga Paradise",
      "date": "2026-01-19",
      "platform": "Limited",
      "synopsis": "Zombies × Idols × Saga — Seriously!? What kind of madness will this outrageous, expectation-defying anime unleash on the big screen!? Legendary girls return as zombies to fight as Saga's local idols in the groundbreaking zombie-idol anime, “ZOMBIE LAND SAGA.” With outrageous zombie antics, unexpectedly moving moments, and music that transcends the idol genre, the series became an instant sensation, spanning its production over two TV anime seasons. And now, their stage expands to the movie theater — everything is packed into this ultimate entertainment experience!!!!!!! The unprecedented Galaxy Festival Movie begins now!!",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/a4xxEU8MQLaVeduHUe3nn7m5iXd.jpg",
      "tmdb_id": 959646,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "Mr. Nobody Against Putin",
      "date": "2026-01-21",
      "platform": "Limited",
      "synopsis": "As Russia launches its full-scale invasion of Ukraine, primary schools across Russia’s hinterlands are transformed into recruitment stages for the war. Facing the ethical dilemma of working in a system defined by propaganda and violence, a brave teacher goes undercover to film what’s really happening in his own school.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/aXCEnrqecvPXohuptN0JRgIvkDj.jpg",
      "tmdb_id": 1393151,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "Cosmic Princess Kaguya!",
      "date": "2026-01-22",
      "platform": "Wide Release",
      "synopsis": "Iroha's life gets knocked off its orbit when Kaguya, a carefree runaway from the Moon, moves in and convinces her to perform in a virtual world together.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/9I9cM38gecZcwJ0C6r0cwfvtPJP.jpg",
      "tmdb_id": 1575337,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "National Theatre Live: Hamlet",
      "date": "2026-01-22",
      "platform": "Limited",
      "synopsis": "Olivier Award-winner Hiran Abeysekera (Life of Pi) is Hamlet in this fearless, contemporary take on Shakespeare’s famous tragedy.  Trapped between duty and doubt, surrounded by power and privilege, young Prince Hamlet dares to ask the ultimate question–you know the one.  National Theatre Deputy Artistic Director, Robert Hastie (Standing at the Sky’s Edge, Operation Mincemeat) directs this sharp, stylish and darkly funny reimagining.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/dBjvFG5F4CZlu6fbUkD0qV0hxPj.jpg",
      "tmdb_id": 1507580,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "Return to Silent Hill",
      "date": "2026-01-23",
      "platform": "Wide Release",
      "synopsis": "When James receives a mysterious letter from his lost love Mary, he is drawn to Silent Hill—a once-familiar town now consumed by darkness. As he searches for her, James faces monstrous creatures and unravels a terrifying truth that will push him to the edge of his sanity.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/fqAGFN2K2kDL0EHxvJaXzaMUkkt.jpg",
      "tmdb_id": 680493,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "Clika",
      "date": "2026-01-23",
      "platform": "Wide Release",
      "synopsis": "Aspiring small-town musician Chito is determined to make it big. When a clip of him performing one of his songs goes viral, he seizes the opportunity and pushes to carve out a place for himself in the new wave of Mexican-American music... and ultimately gets caught in a game more dangerous than anticipated.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/82Vh8PSzWtBi0CLWrnJdRhGYxEr.jpg",
      "tmdb_id": 1450257,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "Once We Were Us",
      "date": "2026-01-23",
      "platform": "Wide Release",
      "synopsis": "Seoul, 2008. On a bus heading to their hometown, fate brings Eun-ho and Jeong-won together, sparking an unlikely friendship. While battling  a bustling and weary city life, they find themselves sharing lofty dreams and a love that comes to feel extraordinary. But, eventually, the harsh realities of life lead them to part ways. Over a decade after the separation, the two unexpectedly reunite on a flight back to Korea, where they reflect on their lost time.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/ivBI8FRQPIKzoZAryZK93xriOT.jpg",
      "tmdb_id": 1264805,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "He's Watching You",
      "date": "2026-01-23",
      "platform": "Wide Release",
      "synopsis": "The film transports us to the sleepy town of Page Hollow, where a string of gruesome murders shatters the quiet community. Shortly after the first killings, outcast high school photographer Cameron discovers a collection of mysterious VHS tapes that may contain cryptic clues to the murders. His discovery launches him into a harrowing race against time, down a path of terrifying revelations - where the killer may be closer than he ever imagined.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/lGrxMTGzoO120uuHuYxwbv5Ypcw.jpg",
      "tmdb_id": 1370424,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "A New Love in Tokyo",
      "date": "2026-01-23",
      "platform": "Limited",
      "synopsis": "A look at the lives of two sex workers in Tokyo: Rei, who works as an S&M dominatrix, and Ayumi, in the more straightforward profession of call girl. In addition to their working life, the film also looks at their private lives. Rei is acting in an amateur theatre company along with the receptionist from Ayumi's escort service, while Ayumi is living with her student-boyfriend as he struggles to finally get accepted to college.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/a4lidbbDWxcsI0M0vW7SN6gipq7.jpg",
      "tmdb_id": 108433,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "Project Y",
      "date": "2026-01-23",
      "platform": "Limited",
      "synopsis": "Mi-sun and Do-kyung might be used to struggling in the most dangerous part of Seoul's Gangnam district, but that doesn't mean they've settled into it. With no one but each other to rely on, the two friends grind away to save the money needed to leave their dangerous lifestyles behind. But just as \"retirement\" comes within reach, the world betrays them, shattering their hopes. On the edge of a dead end, they discover a hidden fortune of dirty cash and gold in Gangnam – and place all their bets on one final high-stakes gamble of a lifetime.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/1KMG1inDAnKaGZ1W8Ac3wn6bdXu.jpg",
      "tmdb_id": 1401542,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "In Cold Light",
      "date": "2026-01-23",
      "platform": "Limited",
      "synopsis": "Fresh out of prison, Ava's attempt to reclaim her drug operation collapses when she witnesses a brutal crime, forcing her to flee into a nightmarish underworld where allies are scarce and enemies multiply by the minute.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/rfudugD3s3VqGoavq05EKXOphEj.jpg",
      "tmdb_id": 1128377,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "Standout: The Ben Kjar Story",
      "date": "2026-01-23",
      "platform": "Limited",
      "synopsis": "Standout tells the powerful story of Ben Kjar, born with Crouzon Syndrome, a rare craniofacial disorder. From birth, doctors warn that his life will be overshadowed by limitations. Ben yearns for an ordinary life free from the harsh scrutiny he faces daily.  However, each experience of adversity, including relentless bullying and a series of painful surgeries, ignites a fire within him. Wrestling becomes his proving ground, a place where he learns to transform his facial difference into a source of power. Determined to succeed, he pushes himself relentlessly, breaking through physical, social, and even romantic barriers that once seemed insurmountable. But as unexpected challenges arise and ridicule resurfaces, Ben finds himself at a defining crossroads: fade into the background of a “normal” life, or fully embrace his unique path and boldly stand out.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/6jUG8yfFkSkJTj467lDmRVvFj4o.jpg",
      "tmdb_id": 1235409,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "The Moment",
      "date": "2026-01-30",
      "platform": "Limited",
      "synopsis": "A rising pop sensation navigates fame and industry pressures while preparing for her arena tour debut, revealing the transformation of underground culture into mainstream success.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/txnHhq3GA1zDxZQMk2igq9CyA8v.jpg",
      "tmdb_id": 1422562,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "Still Hope",
      "date": "2026-02-05",
      "platform": "Limited",
      "synopsis": "Beloved by her family and raised in a quiet community, 16-year-old Hope finds herself in danger when a new friend is not who he claims to be… Ripped from all she knows and forced into sex trafficking, Hope is stripped of her identity and threatened into submission, surviving years of abuse. Hope finally finds freedom and reunites with the family that never gave up looking for her. Though now safe, she struggles adjusting to her old life as she reconciles with all she’s endured. Hope’s journey is inspired by true stories and powerfully illustrates the courage it takes to find healing after life’s darkest moments.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/yjDfgddc0ZynBt4ZKSWNEIkGjB.jpg",
      "tmdb_id": 1548749,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "Dracula",
      "date": "2026-02-06",
      "platform": "Wide Release",
      "synopsis": "When a 15th-century prince denounces God after the devastating loss of his wife, he inherits an eternal curse: he becomes Dracula. Condemned to wander the centuries, he defies fate and death itself, guided by a single hope — to be reunited with his lost love.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/ykyRfv7JDofLxXLAwtLXaSuaFfM.jpg",
      "tmdb_id": 1246049,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "Pillion",
      "date": "2026-02-06",
      "platform": "Wide Release",
      "synopsis": "Colin, a timid man is swept off his feet when Ray, an enigmatic, impossibly handsome biker takes him on as his submissive.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/7Pd6ChSQjSXy4snJiorSdzg2cG3.jpg",
      "tmdb_id": 1287141,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "Whistle",
      "date": "2026-02-06",
      "platform": "Wide Release",
      "synopsis": "When a group of misfit teenagers stumble upon an ancient Aztec death whistle, they learn that by blowing it, its terrifying sound will invoke their future deaths to hunt them down. As the body count rises, the friends investigate the origins of the deadly artifact in a desperate effort to stop the horrifying chain of events that they've set in motion.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/ieOiiCBbf0SNwR39iiA2xnGOnab.jpg",
      "tmdb_id": 1193501,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "The President's Cake",
      "date": "2026-02-06",
      "platform": "Limited",
      "synopsis": "In 1990s Iraq, it's 'draw day', when schools select students for the honour of bringing items to their mandatory local celebrations of President Saddam Hussein's birthday. Nine-year-old Lamia lives in the historic marshes with her spirited grandmother, Bibi. Before school, Bibi teaches Lamia clever tricks to avoid being chosen for the baking duties. However, when Musa, the authoritative teacher, calls Lamia's name for the most challenging task–the birthday cake–she has no choice but to accept. Refusing could mean imprisonment or even death.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/abdw51gf1oy3UWllAwqGl6WdkiS.jpg",
      "tmdb_id": 1464883,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "The Strangers: Chapter 3",
      "date": "2026-02-06",
      "platform": "Limited",
      "synopsis": "Tethered by a frightening conclusion, Maya and the Strangers are locked on an unavoidable, unforgiving collision course — a showdown that proves they’re far from strangers now.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/yPegTig8dQNYiW2UW21LTNChGkK.jpg",
      "tmdb_id": 1010755,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "Solo Mio",
      "date": "2026-02-06",
      "platform": "Limited",
      "synopsis": "After Matt's dreams of a picturesque Italian wedding are shattered when his fiancée leaves him at the altar, he embarks on his planned honeymoon across Italy alone, immersing himself in the country's vibrant culture, food, and beauty, meeting Gia along the way.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/7CHdZJjPl5guYvI9XEVY8m58yHY.jpg",
      "tmdb_id": 1291335,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "Twisted",
      "date": "2026-02-06",
      "platform": "Limited",
      "synopsis": "Two millennials make quick money by leasing incredible New York City apartments they don’t own to people who don’t know they are being scammed. The con works brilliantly until they run into an apartment owner with a dark secret who flips the game on them.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/hluMzOgA98EXRRyc7qcXW3UgkO5.jpg",
      "tmdb_id": 1373198,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "Buffalo Kids",
      "date": "2026-02-06",
      "platform": "Limited",
      "synopsis": "In 1886, orphaned Irish siblings Mary and Tom arrive in New York City via ocean liner, and quickly find themselves on a wild, cross-country journey aboard a transcontinental 'Orphan Train', where they meet an extraordinary new friend who will change their lives forever.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/83WCsJ19Yvg91WTOmDON5akwSI3.jpg",
      "tmdb_id": 1154304,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "Jimpa",
      "date": "2026-02-06",
      "platform": "Limited",
      "synopsis": "Hannah takes her nonbinary teenager, Frances, to Amsterdam to visit their gay grandfather, Jim — lovingly known as Jimpa. But Frances’ desire to stay abroad with Jimpa for a year means Hannah is forced to reconsider her beliefs about parenting and finally confront old stories about the past.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/giSERsYBGUcfj9ctB0h9d5ympo8.jpg",
      "tmdb_id": 1286491,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "Stray Kids: The dominATE Experience",
      "date": "2026-02-06",
      "platform": "Limited",
      "synopsis": "Featuring the global K-Pop sensation Stray Kids and a live performance from their record-breaking world tour, alongside exclusive behind-the-scenes footage and intimate interviews with the band, Stray Kids: The dominATE Experience is an epic concert film that gives fans both a spectacular front-row seat and unique access to their favourite band.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/f1MvTJ25dq924ww9UOnLkj3qqs8.jpg",
      "tmdb_id": 1600421,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "Mimics",
      "date": "2026-02-06",
      "platform": "Limited",
      "synopsis": "Down-on-his-luck impressionist Sam Reinhold makes a pact with Fergus-a wicked, strings-attached puppet-that holds the promise to propel Sam to stardom, unleashing a nightmare that threatens the safety of those he holds dear.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/1ORLmavJReSm0Avy1weIQtEE0vy.jpg",
      "tmdb_id": 1461211,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "My Father's Shadow",
      "date": "2026-02-06",
      "platform": "Limited",
      "synopsis": "Two young brothers explore Lagos with their estranged father during the 1993 Nigerian election crisis, witnessing both the city's magnitude and their father's daily struggles as political unrest threatens their journey home.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/aLQYyqWlIBBU3L8L84txbh0x1nq.jpg",
      "tmdb_id": 1432605,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "Axeman at Cutter's Creek 3: Absolution",
      "date": "2026-02-06",
      "platform": "Limited",
      "synopsis": "Haunted and trapped in a sun-drenched nightmare, Bill must unravel the origins of his torment-and fight his urges-to save his mother and brother from eternal damnation, as guilt and addiction threaten to consume what remains of his soul.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/vDihZh0YSydwvnofb4lmNFz33Uw.jpg",
      "tmdb_id": 1552241,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "Crime 101",
      "date": "2026-02-09",
      "platform": "Wide Release",
      "synopsis": "When an elusive thief whose high-stakes heists unfold along the iconic 101 freeway in Los Angeles eyes the score of a lifetime, with hopes of this being his final job, his path collides with a disillusioned insurance broker who is facing her own crossroads, forcing the two to collaborate. Determined to crack the case, a relentless detective closes in on the operation, raising the stakes even higher.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/fDj8ZATOTmiFy7BF43L3XLIOrf0.jpg",
      "tmdb_id": 1171145,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "Love, Forgotten",
      "date": "2026-02-12",
      "platform": "Limited",
      "synopsis": "Eszter is a successful actress who unexpectedly suffers an accident and suffers amnesia. It turns out that reality has been mixed up in her head: she believes that she lives in the nineties, is a hairdresser and is searching for the One.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/vysEQvmPwh2yJVLzOe21bZlECOy.jpg",
      "tmdb_id": 1555243,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "Cold Storage",
      "date": "2026-02-13",
      "platform": "Wide Release",
      "synopsis": "When a mutating, highly contagious fungus escapes a sealed facility, two young employees – joined by a grizzled bioterror operative – must survive the wildest night shift ever to save humanity from extinction.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/pfqkETJ2A3zXZJuNcufZbAJNnKA.jpg",
      "tmdb_id": 696393,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "GOAT",
      "date": "2026-02-13",
      "platform": "Wide Release",
      "synopsis": "Will, a small goat with big dreams, gets a once-in-a-lifetime shot to join the pros and play roarball – a high-intensity, co-ed, full-contact sport dominated by the fastest, fiercest animals in the world. Will's new teammates aren't thrilled about having a little goat on their roster, but Will is determined to revolutionize the sport and prove once and for all that 'smalls can ball'! He has to do something he has never done before.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/bEd8c3FrcNEjDgsniTfrtvYPDh7.jpg",
      "tmdb_id": 1297842,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "\"Wuthering Heights\"",
      "date": "2026-02-13",
      "platform": "Wide Release",
      "synopsis": "Tragedy strikes when Heathcliff falls in love with Catherine Earnshaw, a woman from a wealthy family in 18th-century England.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/3YBce6dTh1D5oCMITXk2S5QhPt.jpg",
      "tmdb_id": 1316092,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "Nirvanna the Band the Show the Movie",
      "date": "2026-02-13",
      "platform": "Wide Release",
      "synopsis": "When their plan to book a show at the Rivoli goes horribly wrong, Matt and Jay accidentally travel back to the year 2008.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/sm5TGX8WbnCd9Uo26cLyTxVwA1n.jpg",
      "tmdb_id": 1154538,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "The Mortuary Assistant",
      "date": "2026-02-13",
      "platform": "Limited",
      "synopsis": "Rebecca Owens, a recent mortuary science graduate takes a night shift job at River Fields Mortuary. Initially, the job seems straightforward — embalming bodies, completing paperwork, and keeping things tidy. But once Rebecca starts working the night shift, things take a dark turn.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/iqzDIhDTXhlGUctcomJVO1kCNQ.jpg",
      "tmdb_id": 1470130,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "Palestine 36",
      "date": "2026-02-13",
      "platform": "Limited",
      "synopsis": "In 1936, as Palestinian villages revolt against British colonial rule, Yusuf navigates between Jerusalem and his rural home, amidst escalating unrest and a pivotal moment for the British Empire.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/ajeiriNRFPLESjGZ0vdp4MVardZ.jpg",
      "tmdb_id": 1432596,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "Good Luck, Have Fun, Don't Die",
      "date": "2026-02-13",
      "platform": "Limited",
      "synopsis": "A man from the future arrives at a diner in Los Angeles where he must recruit the precise combination of disgruntled patrons to join him on a one-night-six-block quest to save the world from the terminal threat of a rogue artificial intelligence.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/a9Ke9lqGdjK3onlce3ZgyJb0yGf.jpg",
      "tmdb_id": 1119449,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "Hunting Jessica Brok",
      "date": "2026-02-13",
      "platform": "Limited",
      "synopsis": "Long before she was a single mother in a sleepy South African town, Jessica Brok was a highly skilled, coldblooded, special ops assassin. She thought she’d left that life behind. She thought her last ill-fated mission was her last. She thought wrong.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/xRcGnwShS9wpqlTc6KvK4WUY55A.jpg",
      "tmdb_id": 1397335,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "F Valentine's Day",
      "date": "2026-02-13",
      "platform": "Limited",
      "synopsis": "Gina hates her Valentine's Day birthday and travels to Greece to prevent her boyfriend's proposal. With help from vacationers Johnny and his sister Mickey, she schemes to delay it – while questioning her relationship.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/8zPExowfpfZOTpS1W4J7G27lH4H.jpg",
      "tmdb_id": 1429605,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "By Design",
      "date": "2026-02-13",
      "platform": "Limited",
      "synopsis": "A woman swaps bodies with a chair, and everyone likes her better as a chair.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/bF111LXMTw7gZfxC7zxvFkOEKd3.jpg",
      "tmdb_id": 1355496,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "Fate",
      "date": "2026-02-14",
      "platform": "Limited",
      "synopsis": "It takes a minute to find a special person and a entire lifetime to forget them. After a rescue mission gone wrong, a firefighter connects with a super natural visitor while rehabilitating at a sanitarium and is transported through time to find the only thing saving his soul, is his realization of true love.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/xQqWlcAVIvgJw30IWAWy0kkeyu8.jpg",
      "tmdb_id": 1286659,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "The Metropolitan Opera: Cinderella",
      "date": "2026-02-14",
      "platform": "Limited",
      "synopsis": "In this New Year’s Day performance, Laurent Pelly’s storybook staging of Massenet’s Cendrillon, a hit of the 2017–18 season, is presented with an all-new English translation in an abridged 90-minute adaptation, with mezzo-soprano Isabel Leonard as its rags-to-riches princess. Maestro Emmanuel Villaume leads a delightful cast, which includes mezzo-soprano Emily D’Angelo as Cinderella’s Prince Charming, soprano Jessica Pratt as her Fairy Godmother, and mezzo-soprano Stephanie Blythe and bass-baritone Laurent Naouri as her feuding guardians. This live cinema transmission is part of the Met’s award-winning Live in HD series, bringing opera to movie theaters across the globe.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/6yOZrCz2j53NCFWoItaQ5zL5JEH.jpg",
      "tmdb_id": 869183,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "The Apocalypse of St John",
      "date": "2026-02-15",
      "platform": "Limited",
      "synopsis": "Embark on an epic journey through time and faith with 'The Apocalypse of Saint John.' Join the Apostle John in a stunning visual narrative that unravels the visions of the End Times. Experience each vision like never before, with striking visual effects and epic scenes that immerse you in the apocalyptic narrative.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/zzXU586n4uDBgMtVMPPQW7UJwu8.jpg",
      "tmdb_id": 1262299,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "The Apocalypse of St. John",
      "date": "2026-02-15",
      "platform": "Limited",
      "synopsis": "The Apocalypse of St. John invites viewers on an epic journey through the visions revealed to the Apostle John on Patmos. This cinematic experience brings the Book of Revelation to life through striking visuals, immersive sound, and powerful dramatizations that draw audiences deep into the apocalyptic narrative. Beyond its spectacle, the film offers clear and engaging explanations of each vision, illuminating their theological meaning through the lens of ancient Christian tradition. It presents Revelation not as distant symbolism, but as a living prophecy with profound relevance for our age. Blending drama, documentary insight, and faithful exegesis, the film guides viewers through the mysteries of the End Times and the great spiritual battle at the heart of the prophecy.",
      "type": "theatrical",
      "poster": null,
      "tmdb_id": 1593691,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "The Dangers in My Heart: The Movie",
      "date": "2026-02-16",
      "platform": "Limited",
      "synopsis": "A re-edit of both anime seasons featuring newly added footage and will depict the story of Ichikawa and Yamada after the events of the TV series.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/8aP916aOB8gvRPrL8aY9enflu3e.jpg",
      "tmdb_id": 1363979,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "I Can Only Imagine 2",
      "date": "2026-02-20",
      "platform": "Limited",
      "synopsis": "After the breakout success of the song \"I Can Only Imagine,\" MercyMe's Bart Millard is living the dream—sold-out arenas, a devoted fan base, and a thriving career. But behind the spotlight, Bart's past threatens the family he's built, especially the fragile bond with his son, Sam. When hopeful newcomer Tim Timmons joins the band for their biggest tour yet, he unknowingly brings a renewed gratitude to Bart's life through their unlikely friendship. Bart soon discovers that Tim carries hardships—and secrets—of his own, forcing him to face his past and repair his relationships with Sam and his wife, Shannon, before fame costs him what matters most.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/qYBCs9nBmdNCLduw5BTlendq89z.jpg",
      "tmdb_id": 1405769,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "EPiC: Elvis Presley in Concert",
      "date": "2026-02-20",
      "platform": "Limited",
      "synopsis": "A mix of a documentary and concert film made using unused footage from Elvis: That's the Way It Is, the film of Elvis' legendary 1970 Summer Festival in Las Vegas and Elvis's road concert film from two years later, Elvis on Tour, that were found during the production of 2022's Elvis.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/433YxgwVpX8sUPbqzjTAQjLkPX0.jpg",
      "tmdb_id": 1445363,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "Midwinter Break",
      "date": "2026-02-20",
      "platform": "Limited",
      "synopsis": "A stirring meditation on faith, commitment, and the enduring power of love, as a longtime couple takes a life-changing trip to Amsterdam.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/6rVqtRTY1HFxYwgj8Ovtnwsq1vo.jpg",
      "tmdb_id": 1125701,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "Diabolic",
      "date": "2026-02-20",
      "platform": "Limited",
      "synopsis": "A woman's hope for a miracle cure turns into a nightmare when she confronts the vengeful spirit of a cursed witch, determined to claim her as a vessel for her evil power.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/4Ep7jV6IlLfCnWe6LCBs7n0n3Q9.jpg",
      "tmdb_id": 1375831,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "Psycho Killer",
      "date": "2026-02-20",
      "platform": "Limited",
      "synopsis": "Following the brutal murder of her husband, a Kansas highway patrol officer sets out on a journey to track down the perpetrator. As the hunt progresses, she comes to realize the man responsible is a sadistic serial killer, and the depth of his mental depravity and his sinister agenda is more twisted than anyone could have imagined.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/zNfoMfpOgsfZ9axV0UzNFKVh0wG.jpg",
      "tmdb_id": 1107166,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "The Dreadful",
      "date": "2026-02-20",
      "platform": "Limited",
      "synopsis": "Set against the backdrop of the War of the Roses follows Anne and her mother-in-law Morwen, who live a solitary, harsh life on the outskirts of society. But when a man from their past returns, he will set off a sequence of events that become a turning point for Anne.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/As1SkUenVWlIZjiYnWZbMuzNRle.jpg",
      "tmdb_id": 1242937,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "The Third Parent",
      "date": "2026-02-20",
      "platform": "Limited",
      "synopsis": "A neighborhood Fourth of July celebration is interrupted by a ferociously bizarre anomaly who overpowers a family in order to teach them how to become better people and more compliant citizens.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/p8o3dtzoN5pkkm0oWxu4PuAzOjp.jpg",
      "tmdb_id": 1206628,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "This Is Not a Test",
      "date": "2026-02-20",
      "platform": "Limited",
      "synopsis": "Sloane and four classmates take cover in Cortege High to escape a world plagued by the infected. As danger relentlessly pounds on the doors, Sloane begins to see the world through the eyes of those who actually want to live and takes matters into her own hands.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/pLYiyfCYmuLDYf36AbQApadFUhN.jpg",
      "tmdb_id": 1428990,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "Redux Redux",
      "date": "2026-02-20",
      "platform": "Limited",
      "synopsis": "A woman travels the multiverse, killing her daughter’s murderer over and over again. She grows addicted to the revenge streak, putting her own humanity in jeopardy.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/nDO9RIorCX6OxzZfUjbkcMGx7cK.jpg",
      "tmdb_id": 1340110,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "Billy Preston: That's the Way God Planned It",
      "date": "2026-02-20",
      "platform": "Limited",
      "synopsis": "With his signature gospel sound on the Hammond B3, Billy Preston doublehandedly elevated the greatest artists of his time – from the Beatles to the Rolling Stones, from Aretha Franklin to Eric Clapton, from Ray Charles to Barbra Streisand to Sly and the Family Stone. In our film, we explore Billy's career and influence on generations of musicians, as he scored several number one hits of his own and became one of the most sought-after musicians in the world. He did all of this as a soul divided -- by his deep roots in the church, in constant conflict with his identity as a gay Black man, searching for a family of his own that would accept him for who he was.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/bfb1T0BNkDVqrOrQmUPsaNsj7o1.jpg",
      "tmdb_id": 1242018,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "Homecoming: The Tokyo Series",
      "date": "2026-02-23",
      "platform": "Limited",
      "synopsis": "In 2025, as MLB's Dodgers and Cubs clash in Tokyo for a historic season opener, their games become a lens into Japan's passionate baseball culture and the values that bind two nations through America's pastime.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/eVLBoQkBxeyuh7akvDWHdhnJvNI.jpg",
      "tmdb_id": 1584911,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "Twenty One Pilots: More Than We Ever Imagined",
      "date": "2026-02-25",
      "platform": "Limited",
      "synopsis": "Experience the electrifying concert film capturing Twenty One Pilots at a career-defining moment: their monumental Mexico City headline show, performing in front of 65,000 fans at Estadio GNP Seguros during The Clancy World Tour.  Set against the vibrant pulse of one of the world’s most iconic music capitals, the film blends cinematic high-energy performance footage with intimate, behind-the-scenes access, revealing the heart, humor, and humanity of the artists as they prepare for one of the biggest shows of their career.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/4awhWx8MOS6bQhzbicXRFdyFDIG.jpg",
      "tmdb_id": 1612063,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "Scream 7",
      "date": "2026-02-27",
      "platform": "Wide Release",
      "synopsis": "When a new Ghostface killer emerges in the quiet town where Sidney Prescott has built a new life, her darkest fears are realized as her daughter becomes the next target. Determined to protect her family, Sidney must face the horrors of her past to put an end to the bloodshed once and for all.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/jjyuk0edLiW8vOSnlfwWCCLpbh5.jpg",
      "tmdb_id": 1159559,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "Umamusume: Pretty Derby - Beginning of a New Era",
      "date": "2026-02-27",
      "platform": "Wide Release",
      "synopsis": "Jungle Pocket, an Umamusume who has been racing tirelessly in pursuit of becoming the greatest, is ready to take on the once-in-a-lifetime Classic Triple Crown series. However, standing in her way are rivals from the same generation, whose talent may even surpass her own.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/n9WL32ByfOcZoqYpmQA46U79byo.jpg",
      "tmdb_id": 1223178,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "What Does That Nature Say to You",
      "date": "2026-02-27",
      "platform": "Limited",
      "synopsis": "A young poet drops his girlfriend off at her parents' house and is amazed by its size. He bumps into her father, meets her mother and sister, and they all end up spending a long day together; fueled by conversation, food and libations.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/uGeXezCeU8oxJlA1p8xhAywCC2r.jpg",
      "tmdb_id": 1418849,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "K-Pops!",
      "date": "2026-02-27",
      "platform": "Limited",
      "synopsis": "A washed-up musician travels to Korea to write for K-pop stars, discovering that his long-lost son is set to front one of the country’s hottest new groups. He then jumps at the opportunity to capitalize on his son’s stardom for his own renaissance, but learns that fatherhood is much more fulfilling and meaningful than stardom.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/72KQHN1xUO6gWHLRRPyJcCQXlve.jpg",
      "tmdb_id": 972232,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "How to Make a Killing",
      "date": "2026-02-27",
      "platform": "Limited",
      "synopsis": "Disowned at birth by his obscenely wealthy family, blue-collar Becket Redfellow will stop at nothing to reclaim his inheritance, no matter how many relatives stand in his way.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/yQ7OP2HYxl9YmkWNMkuUA2YaF5.jpg",
      "tmdb_id": 467905,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "Undercard",
      "date": "2026-02-27",
      "platform": "Limited",
      "synopsis": "After abandoning her son, a female boxing trainer rises from the ashes to coach him in the biggest fight of his career.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/5QRH0zH0rCYHuEkwz5vAVORfSji.jpg",
      "tmdb_id": 1245084,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "Idiotka",
      "date": "2026-02-27",
      "platform": "Limited",
      "synopsis": "In this sharp, irreverent comedy, a disgraced fashion designer with a dangerously low credit score, Margarita enters a reality show with a six-figure cash prize to save her babushka’s West Hollywood apartment. But as the competition intensifies, slick producer Nicol pushes her to spin her family’s struggle into spectacle, forcing Margarita to decide whether to play along or take control of her own narrative, one unhinged look at a time.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/mxa6MGgZOd1PKlYWNJ1iOQsy9PN.jpg",
      "tmdb_id": 1430968,
      "letterboxd_rating": null,
      "letterboxd_url": null
    },
    {
      "title": "The Napa Boys",
      "date": "2026-02-27",
      "platform": "Limited",
      "synopsis": "Jack Jr, Miles Jr and the whole gang are back for one last wine-soaked journey prompted by the mysterious \"Sommelier.\" Joined this time by Puck, a fan of The Napa Boys comics, the group will learn about love, loss, friendship and viticulture.",
      "type": "theatrical",
      "poster": "https://image.tmdb.org/t/p/w154/1JeYOqNB3jlMLT1uZxKvk3WYqsw.jpg",
      "tmdb_id": 1517305,
      "letterboxd_rating": null,
      "letterboxd_url": null
    }
  ]
}